/*
 Navicat MySQL Dump SQL

 Source Server         : student-score
 Source Server Type    : MySQL
 Source Server Version : 90700 (9.7.0)
 Source Host           : localhost:3306
 Source Schema         : db_student_score

 Target Server Type    : MySQL
 Target Server Version : 90700 (9.7.0)
 File Encoding         : 65001

 Date: 01/05/2026 22:23:22
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for admin
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `password` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `real_name` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `level` tinyint NOT NULL DEFAULT 0,
  `school` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `email` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '0',
  `phone` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `sex` tinyint NOT NULL DEFAULT 0,
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 2 CHARACTER SET = utf8mb3 COLLATE = utf8mb3_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES (1, 'admin', '123456', '管理员', 0, '湘潭大学', '123555@qq.com', '13366554487', 0, '2023-03-28 15:06:24');

-- ----------------------------
-- Table structure for course
-- ----------------------------
DROP TABLE IF EXISTS `course`;
CREATE TABLE `course`  (
  `id` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '' COMMENT '编号',
  `name` varchar(40) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL COMMENT '课程名',
  `credits` decimal(4, 1) NOT NULL DEFAULT 2.0 COMMENT '学分',
  `score` int NOT NULL DEFAULT 100 COMMENT '满分',
  `number` int NOT NULL DEFAULT 32 COMMENT '课时',
  `year` int NOT NULL DEFAULT 2016 COMMENT '届时',
  `term` tinyint NOT NULL DEFAULT 0 COMMENT '学期',
  `type` tinyint NOT NULL DEFAULT 1 COMMENT '类别 1必修 2选修',
  `profession` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '' COMMENT '专业',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb3 COLLATE = utf8mb3_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of course
-- ----------------------------
INSERT INTO `course` VALUES ('2024011001', '数字电路基础', 4.0, 100, 18, 2024, 1, 1, '电子信息工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024011002', '大学物理', 4.0, 100, 20, 2024, 1, 1, '电子信息工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024011003', '线性代数', 1.0, 100, 18, 2024, 1, 1, '电子信息工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024011004', '复变函数', 2.0, 100, 18, 2024, 1, 1, '电子信息工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024011005', '模拟电子线路', 4.0, 100, 18, 2024, 1, 1, '电子信息工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024011006', '信号与系统', 2.0, 100, 18, 2024, 1, 1, '电子信息工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024011007', '大学英语', 4.0, 100, 18, 2024, 1, 1, '电子信息工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024011008', '体育', 1.0, 100, 16, 2024, 1, 1, '电子信息工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024011009', '电子技术', 2.0, 100, 16, 2024, 1, 1, '电子信息工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024011010', '多媒体技术', 2.0, 100, 18, 2024, 1, 1, '电子信息工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024021001', '物联网工程导论', 2.0, 100, 18, 2024, 1, 1, '物联网', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024021002', '物联网安全', 2.0, 100, 18, 2024, 1, 1, '物联网', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024021003', '现代通信技术', 1.0, 100, 18, 2024, 1, 1, '物联网', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024021004', '无线传感器网络', 4.0, 100, 18, 2024, 1, 1, '物联网', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024021005', '现代传感器技术', 2.0, 100, 18, 2024, 1, 1, '物联网', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024021006', '信号与系统概论', 2.0, 100, 18, 2024, 1, 1, '物联网', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024031001', '计算机网络技术', 1.0, 100, 18, 2024, 1, 1, '计算机', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024031002', '网络与通信', 1.0, 100, 18, 2024, 1, 1, '计算机', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024031003', '计算机安全', 2.0, 100, 15, 2024, 1, 1, '计算机', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024031004', '算法与数据结构', 4.0, 100, 18, 2024, 1, 1, '计算机', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024031005', '多媒体信息处理', 2.0, 100, 14, 2024, 1, 1, '计算机', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024031006', '计算机组成原理', 2.0, 100, 18, 2024, 1, 1, '计算机', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024041001', '高频电子线路', 4.0, 100, 18, 2024, 1, 1, '通信工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024041002', '光纤通讯', 2.0, 100, 16, 2024, 1, 1, '通信工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024041003', '移动通讯', 1.0, 100, 18, 2024, 1, 1, '通信工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024041004', '电路分析', 1.0, 100, 18, 2024, 1, 1, '通信工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024041005', '程控交换技术', 2.0, 100, 18, 2024, 1, 1, '通信工程', '2023-03-31 15:50:22');
INSERT INTO `course` VALUES ('2024041006', '通信原理', 4.0, 100, 18, 2024, 1, 1, '通信工程', '2023-03-31 15:50:22');

-- ----------------------------
-- Table structure for course_info
-- ----------------------------
DROP TABLE IF EXISTS `course_info`;
CREATE TABLE `course_info`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `course_id` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `start` int NOT NULL,
  `end` int NOT NULL,
  `room` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `profession` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `ci_course`(`course_id` ASC) USING BTREE,
  CONSTRAINT `ci_course` FOREIGN KEY (`course_id`) REFERENCES `course` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE = InnoDB AUTO_INCREMENT = 31 CHARACTER SET = utf8mb3 COLLATE = utf8mb3_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of course_info
-- ----------------------------
INSERT INTO `course_info` VALUES (1, '2024011001', 1, 25, '404', '电子信息工程');
INSERT INTO `course_info` VALUES (2, '2024011002', 1, 25, '401', '电子信息工程');
INSERT INTO `course_info` VALUES (3, '2024011003', 1, 25, '403', '电子信息工程');
INSERT INTO `course_info` VALUES (4, '2024011004', 1, 25, '406', '电子信息工程');
INSERT INTO `course_info` VALUES (5, '2024011005', 1, 25, '405', '电子信息工程');
INSERT INTO `course_info` VALUES (6, '2024011006', 1, 25, '402', '电子信息工程');
INSERT INTO `course_info` VALUES (7, '2024021001', 1, 25, '505', '物联网');
INSERT INTO `course_info` VALUES (8, '2024021002', 1, 25, NULL, '物联网');
INSERT INTO `course_info` VALUES (9, '2024021003', 1, 25, NULL, '物联网');
INSERT INTO `course_info` VALUES (10, '2024021005', 1, 25, NULL, '物联网');
INSERT INTO `course_info` VALUES (11, '2024021006', 1, 25, NULL, '物联网');
INSERT INTO `course_info` VALUES (12, '2024031001', 1, 25, '506', '计算机');
INSERT INTO `course_info` VALUES (13, '2024031002', 1, 25, NULL, '计算机');
INSERT INTO `course_info` VALUES (14, '2024031003', 1, 25, NULL, '计算机');
INSERT INTO `course_info` VALUES (15, '2024031004', 1, 25, NULL, '计算机');
INSERT INTO `course_info` VALUES (16, '2024031005', 1, 25, NULL, '计算机');
INSERT INTO `course_info` VALUES (17, '2024031006', 1, 25, NULL, '计算机');
INSERT INTO `course_info` VALUES (18, '2024041001', 1, 25, '506', '通信工程');
INSERT INTO `course_info` VALUES (19, '2024041002', 1, 25, NULL, '通信工程');
INSERT INTO `course_info` VALUES (20, '2024041003', 1, 25, NULL, '通信工程');
INSERT INTO `course_info` VALUES (21, '2024021004', 1, 25, NULL, '物联网');
INSERT INTO `course_info` VALUES (22, '2024041004', 1, 25, NULL, '通信工程');
INSERT INTO `course_info` VALUES (23, '2024041005', 1, 25, NULL, '通信工程');
INSERT INTO `course_info` VALUES (24, '2024041006', 1, 25, NULL, '通信工程');
INSERT INTO `course_info` VALUES (27, '2024011007', 1, 25, NULL, '电子信息工程');
INSERT INTO `course_info` VALUES (28, '2024011008', 1, 25, NULL, '电子信息工程');
INSERT INTO `course_info` VALUES (29, '2024011009', 1, 25, NULL, '电子信息工程');
INSERT INTO `course_info` VALUES (30, '2024011010', 1, 25, NULL, '电子信息工程');

-- ----------------------------
-- Table structure for profession
-- ----------------------------
DROP TABLE IF EXISTS `profession`;
CREATE TABLE `profession`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 13 CHARACTER SET = utf8mb3 COLLATE = utf8mb3_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of profession
-- ----------------------------
INSERT INTO `profession` VALUES (1, '电子信息工程');
INSERT INTO `profession` VALUES (2, '物联网');
INSERT INTO `profession` VALUES (3, '计算机');
INSERT INTO `profession` VALUES (4, '通信工程');
INSERT INTO `profession` VALUES (5, '土木工程');
INSERT INTO `profession` VALUES (6, '网络工程');
INSERT INTO `profession` VALUES (7, '工程造价');
INSERT INTO `profession` VALUES (8, '会计');
INSERT INTO `profession` VALUES (9, '环境工程');
INSERT INTO `profession` VALUES (12, '123');

-- ----------------------------
-- Table structure for student
-- ----------------------------
DROP TABLE IF EXISTS `student`;
CREATE TABLE `student`  (
  `id` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `username` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `password` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `real_name` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `level` tinyint NOT NULL DEFAULT 2,
  `school` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `admission_time` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `email` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '0',
  `profession` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `grade` int NOT NULL,
  `phone` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `sex` tinyint NOT NULL DEFAULT 0,
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb3 COLLATE = utf8mb3_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of student
-- ----------------------------
INSERT INTO `student` VALUES ('202405560501', '202405560501', '123456', '郑云莲', 2, '湘潭大学', '2024', '58645864@qq.com', '环境工程', 2401, '13501131111', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560502', '202405560502', '123456', '和壮', 2, '湘潭大学', '2024', '06508@qq.com', '环境工程', 2401, '13201104001', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560503', '202405560503', '123456', '陈娜', 2, '湘潭大学', '2024', '678562@qq.com', '环境工程', 2401, '15003701063', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560504', '202405560504', '123456', '元德', 2, '湘潭大学', '2024', '78067@qq.com', '环境工程', 2401, '13502114121', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560505', '202405560505', '123456', '齐江超', 2, '湘潭大学', '2024', '46235@qq.com', '环境工程', 2401, '15301150413', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560506', '202405560506', '123456', '纪艳', 2, '湘潭大学', '2024', '2083788@qq.com', '环境工程', 2401, '15007214271', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560507', '202405560507', '123456', '毕楠榕', 2, '湘潭大学', '2024', '727708@qq.com', '环境工程', 2401, '15501767430', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560508', '202405560508', '123456', '毛蓉眉', 2, '湘潭大学', '2024', '705047780@qq.com', '环境工程', 2401, '15101611021', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560509', '202405560509', '123456', '郎时', 2, '湘潭大学', '2024', '82340@qq.com', '环境工程', 2401, '13007212151', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560510', '202405560510', '123456', '顾庆', 2, '湘潭大学', '2024', '206266355@qq.com', '环境工程', 2401, '15105140121', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560511', '202405560511', '123456', '毛奇', 2, '湘潭大学', '2024', '03020505@qq.com', '环境工程', 2401, '15703356141', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560512', '202405560512', '123456', '庞言', 2, '湘潭大学', '2024', '0223247@qq.com', '环境工程', 2401, '13306170002', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560513', '202405560513', '123456', '罗策腾', 2, '湘潭大学', '2024', '506347@qq.com', '环境工程', 2401, '13207170711', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560514', '202405560514', '123456', '秦榕', 2, '湘潭大学', '2024', '577757202@qq.com', '环境工程', 2401, '15706105132', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560515', '202405560515', '123456', '孟民', 2, '湘潭大学', '2024', '27732385@qq.com', '环境工程', 2401, '13104661621', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560516', '202405560516', '123456', '云建家', 2, '湘潭大学', '2024', '483865@qq.com', '环境工程', 2401, '13005174120', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560517', '202405560517', '123456', '姜军', 2, '湘潭大学', '2024', '600038@qq.com', '环境工程', 2401, '15704477611', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560518', '202405560518', '123456', '齐浩亮', 2, '湘潭大学', '2024', '385200542@qq.com', '环境工程', 2401, '13001221112', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560519', '202405560519', '123456', '董健世', 2, '湘潭大学', '2024', '437335456@qq.com', '环境工程', 2401, '15600716565', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560520', '202405560520', '123456', '云鹏泽', 2, '湘潭大学', '2024', '00766485@qq.com', '环境工程', 2401, '15701030314', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560521', '202405560521', '123456', '梁鸣', 2, '湘潭大学', '2024', '755608@qq.com', '环境工程', 2401, '13007401111', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560522', '202405560522', '123456', '伍固之', 2, '湘潭大学', '2024', '23560248@qq.com', '环境工程', 2401, '15004102706', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560523', '202405560523', '123456', '戴翰', 2, '湘潭大学', '2024', '740864253@qq.com', '环境工程', 2401, '15601550653', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560524', '202405560524', '123456', '孙松善', 2, '湘潭大学', '2024', '3880784@qq.com', '环境工程', 2401, '13306101141', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560525', '202405560525', '123456', '戚祥', 2, '湘潭大学', '2024', '6063730@qq.com', '环境工程', 2401, '15100350167', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560526', '202405560526', '123456', '余顺', 2, '湘潭大学', '2024', '550285@qq.com', '环境工程', 2401, '15607124151', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560527', '202405560527', '123456', '华琰', 2, '湘潭大学', '2024', '48254423@qq.com', '环境工程', 2401, '15003226614', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560528', '202405560528', '123456', '钱若鸣', 2, '湘潭大学', '2024', '6706@qq.com', '环境工程', 2401, '15504366173', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560529', '202405560529', '123456', '常宁欣', 2, '湘潭大学', '2024', '382403@qq.com', '环境工程', 2401, '15101144173', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405560530', '202405560530', '123456', '成炎德', 2, '湘潭大学', '2024', '748840703@qq.com', '环境工程', 2401, '13206164611', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561501', '202405561501', '123456', '秦辰', 2, '湘潭大学', '2024', '58008563@qq.com', '会计学', 2401, '13401726111', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561502', '202405561502', '123456', '苏寒', 2, '湘潭大学', '2024', '63767730@qq.com', '会计学', 2401, '13006626404', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561503', '202405561503', '123456', '平红', 2, '湘潭大学', '2024', '446432@qq.com', '会计学', 2401, '15004750137', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561504', '202405561504', '123456', '平柔', 2, '湘潭大学', '2024', '85862545@qq.com', '会计学', 2401, '15004742214', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561505', '202405561505', '123456', '彭群豪', 2, '湘潭大学', '2024', '6448570@qq.com', '会计学', 2401, '13007173005', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561506', '202405561506', '123456', '赵思', 2, '湘潭大学', '2024', '6636308@qq.com', '会计学', 2401, '15500010156', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561507', '202405561507', '123456', '郑亚', 2, '湘潭大学', '2024', '32566645@qq.com', '会计学', 2401, '13105153651', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561508', '202405561508', '123456', '章强军', 2, '湘潭大学', '2024', '23856573@qq.com', '会计学', 2401, '15102171517', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561509', '202405561509', '123456', '苗梅', 2, '湘潭大学', '2024', '434080046@qq.com', '会计学', 2401, '13100052701', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561510', '202405561510', '123456', '卜若鸣', 2, '湘潭大学', '2024', '624528@qq.com', '会计学', 2401, '13504425523', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561511', '202405561511', '123456', '鲍融', 2, '湘潭大学', '2024', '65387526@qq.com', '会计学', 2401, '13506461411', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561512', '202405561512', '123456', '何兰凤', 2, '湘潭大学', '2024', '8308342@qq.com', '会计学', 2401, '15007115517', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561513', '202405561513', '123456', '成裕', 2, '湘潭大学', '2024', '755660@qq.com', '会计学', 2401, '15002471671', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561514', '202405561514', '123456', '于君琴', 2, '湘潭大学', '2024', '885@qq.com', '会计学', 2401, '13500071317', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561515', '202405561515', '123456', '宋翔旭', 2, '湘潭大学', '2024', '28352553@qq.com', '会计学', 2401, '13100314604', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561516', '202405561516', '123456', '姚娜', 2, '湘潭大学', '2024', '3026550@qq.com', '会计学', 2401, '15704244011', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561517', '202405561517', '123456', '祁晶妍', 2, '湘潭大学', '2024', '86283346@qq.com', '会计学', 2401, '15506711014', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561518', '202405561518', '123456', '吴娟', 2, '湘潭大学', '2024', '6854460@qq.com', '会计学', 2401, '13307725743', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561519', '202405561519', '123456', '任士以', 2, '湘潭大学', '2024', '824374634@qq.com', '会计学', 2401, '15000075200', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561520', '202405561520', '123456', '席真环', 2, '湘潭大学', '2024', '27822628@qq.com', '会计学', 2401, '15100467152', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561521', '202405561521', '123456', '湛瑶', 2, '湘潭大学', '2024', '6045563@qq.com', '会计学', 2401, '13201541411', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561522', '202405561522', '123456', '彭胜', 2, '湘潭大学', '2024', '08765006@qq.com', '会计学', 2401, '13107414315', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561523', '202405561523', '123456', '彭博', 2, '湘潭大学', '2024', '057370865@qq.com', '会计学', 2401, '15300114321', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561524', '202405561524', '123456', '滕心邦', 2, '湘潭大学', '2024', '5066580@qq.com', '会计学', 2401, '13204761141', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561525', '202405561525', '123456', '毛仪', 2, '湘潭大学', '2024', '658374@qq.com', '会计学', 2401, '15502465623', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561526', '202405561526', '123456', '喻生龙', 2, '湘潭大学', '2024', '05276@qq.com', '会计学', 2401, '15706111422', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561527', '202405561527', '123456', '汪健世', 2, '湘潭大学', '2024', '35366243@qq.com', '会计学', 2401, '15300211736', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561528', '202405561528', '123456', '酆康星', 2, '湘潭大学', '2024', '0868687@qq.com', '会计学', 2401, '13107413203', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561529', '202405561529', '123456', '范福', 2, '湘潭大学', '2024', '075658@qq.com', '会计学', 2401, '13006163711', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405561530', '202405561530', '123456', '毕娟', 2, '湘潭大学', '2024', '3708884@qq.com', '会计学', 2401, '13105415016', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562501', '202405562501', '123456', '宋岩中', 2, '湘潭大学', '2024', '83023356@qq.com', '工程造价', 2401, '15101116721', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562502', '202405562502', '123456', '舒雁蓓', 2, '湘潭大学', '2024', '660288343@qq.com', '工程造价', 2401, '13200611455', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562503', '202405562503', '123456', '赵承乐', 2, '湘潭大学', '2024', '3745563@qq.com', '工程造价', 2401, '13404124307', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562504', '202405562504', '123456', '卫军', 2, '湘潭大学', '2024', '684853@qq.com', '工程造价', 2401, '13705644116', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562505', '202405562505', '123456', '汤锦黛', 2, '湘潭大学', '2024', '6664670@qq.com', '工程造价', 2401, '13505571250', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562506', '202405562506', '123456', '倪裕', 2, '湘潭大学', '2024', '00552606@qq.com', '工程造价', 2401, '13201511571', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562507', '202405562507', '123456', '严霭', 2, '湘潭大学', '2024', '43800020@qq.com', '工程造价', 2401, '15005141731', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562508', '202405562508', '123456', '韩士以', 2, '湘潭大学', '2024', '28236808@qq.com', '工程造价', 2401, '15106051466', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562509', '202405562509', '123456', '姚之', 2, '湘潭大学', '2024', '8322278@qq.com', '工程造价', 2401, '13602011127', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562510', '202405562510', '123456', '方思', 2, '湘潭大学', '2024', '86375@qq.com', '工程造价', 2401, '13600614131', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562511', '202405562511', '123456', '纪洁梅', 2, '湘潭大学', '2024', '3832445@qq.com', '工程造价', 2401, '13301227112', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562512', '202405562512', '123456', '元勤', 2, '湘潭大学', '2024', '8668754@qq.com', '工程造价', 2401, '13104211110', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562513', '202405562513', '123456', '卞时', 2, '湘潭大学', '2024', '73520726@qq.com', '工程造价', 2401, '15100535217', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562514', '202405562514', '123456', '平心邦', 2, '湘潭大学', '2024', '837083@qq.com', '工程造价', 2401, '15702721144', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562515', '202405562515', '123456', '郝俊峰', 2, '湘潭大学', '2024', '6568722@qq.com', '工程造价', 2401, '13100035177', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562516', '202405562516', '123456', '皮淑', 2, '湘潭大学', '2024', '26237@qq.com', '工程造价', 2401, '15003011511', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562517', '202405562517', '123456', '褚哲', 2, '湘潭大学', '2024', '577585485@qq.com', '工程造价', 2401, '15003314474', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562518', '202405562518', '123456', '张健世', 2, '湘潭大学', '2024', '27826474@qq.com', '工程造价', 2401, '15103750451', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562519', '202405562519', '123456', '雷倩', 2, '湘潭大学', '2024', '08388503@qq.com', '工程造价', 2401, '13102112211', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562520', '202405562520', '123456', '沈坚和', 2, '湘潭大学', '2024', '42248@qq.com', '工程造价', 2401, '13101132013', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562521', '202405562521', '123456', '姚言', 2, '湘潭大学', '2024', '77537@qq.com', '工程造价', 2401, '15500116160', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562522', '202405562522', '123456', '云以', 2, '湘潭大学', '2024', '406507083@qq.com', '工程造价', 2401, '15105657610', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562523', '202405562523', '123456', '华强军', 2, '湘潭大学', '2024', '5226005@qq.com', '工程造价', 2401, '15206175421', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562524', '202405562524', '123456', '吕彬', 2, '湘潭大学', '2024', '22833564@qq.com', '工程造价', 2401, '13406662110', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562525', '202405562525', '123456', '贺晶妍', 2, '湘潭大学', '2024', '43026652@qq.com', '工程造价', 2401, '13000110040', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562526', '202405562526', '123456', '卞茂进', 2, '湘潭大学', '2024', '35533066@qq.com', '工程造价', 2401, '13604415121', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562527', '202405562527', '123456', '舒克伦', 2, '湘潭大学', '2024', '582038657@qq.com', '工程造价', 2401, '13707157127', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562528', '202405562528', '123456', '阮卿', 2, '湘潭大学', '2024', '6773747@qq.com', '工程造价', 2401, '15201670043', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562529', '202405562529', '123456', '阮辉力', 2, '湘潭大学', '2024', '37602667@qq.com', '工程造价', 2401, '15101637412', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562530', '202405562530', '123456', '苏裕', 2, '湘潭大学', '2024', '752778@qq.com', '工程造价', 2401, '13100170160', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562601', '202405562601', '123456', '殷茜秋', 2, '湘潭大学', '2024', '07506028@qq.com', '工程造价', 2402, '15505470052', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562602', '202405562602', '123456', '罗飘育', 2, '湘潭大学', '2024', '564567@qq.com', '工程造价', 2402, '13400012727', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562603', '202405562603', '123456', '沈梅', 2, '湘潭大学', '2024', '463340@qq.com', '工程造价', 2402, '13306322232', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562604', '202405562604', '123456', '廉友裕', 2, '湘潭大学', '2024', '50404046@qq.com', '工程造价', 2402, '13600362111', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562605', '202405562605', '123456', '葛亮', 2, '湘潭大学', '2024', '58802@qq.com', '工程造价', 2402, '13607311376', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562606', '202405562606', '123456', '尹有', 2, '湘潭大学', '2024', '0725276@qq.com', '工程造价', 2402, '15305212141', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562607', '202405562607', '123456', '俞凤', 2, '湘潭大学', '2024', '6377723@qq.com', '工程造价', 2402, '13401005604', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562608', '202405562608', '123456', '方栋', 2, '湘潭大学', '2024', '552@qq.com', '工程造价', 2402, '13202321164', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562609', '202405562609', '123456', '郝厚庆', 2, '湘潭大学', '2024', '25754474@qq.com', '工程造价', 2402, '13700452112', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562610', '202405562610', '123456', '严敬震', 2, '湘潭大学', '2024', '542825@qq.com', '工程造价', 2402, '15604727123', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562611', '202405562611', '123456', '陶健世', 2, '湘潭大学', '2024', '80684252@qq.com', '工程造价', 2402, '13003514437', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562612', '202405562612', '123456', '雷安', 2, '湘潭大学', '2024', '067284@qq.com', '工程造价', 2402, '13105217674', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562613', '202405562613', '123456', '曹克伦', 2, '湘潭大学', '2024', '545706453@qq.com', '工程造价', 2402, '13505411011', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562614', '202405562614', '123456', '史毅', 2, '湘潭大学', '2024', '02738@qq.com', '工程造价', 2402, '13004510172', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562615', '202405562615', '123456', '梁磊民', 2, '湘潭大学', '2024', '572475@qq.com', '工程造价', 2402, '13002041064', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562616', '202405562616', '123456', '明元全', 2, '湘潭大学', '2024', '4062005@qq.com', '工程造价', 2402, '15303152441', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562617', '202405562617', '123456', '孟茂进', 2, '湘潭大学', '2024', '8385450@qq.com', '工程造价', 2402, '13304210117', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562618', '202405562618', '123456', '湛婉娴', 2, '湘潭大学', '2024', '3254873@qq.com', '工程造价', 2402, '13100121011', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562619', '202405562619', '123456', '孔妹', 2, '湘潭大学', '2024', '0267320@qq.com', '工程造价', 2402, '15201575211', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562620', '202405562620', '123456', '皮涛', 2, '湘潭大学', '2024', '5507548@qq.com', '工程造价', 2402, '13404370613', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562621', '202405562621', '123456', '孟萍红', 2, '湘潭大学', '2024', '58577@qq.com', '工程造价', 2402, '13100576621', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562622', '202405562622', '123456', '戚亨奇', 2, '湘潭大学', '2024', '4623852@qq.com', '工程造价', 2402, '15301012121', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562623', '202405562623', '123456', '姚洁梅', 2, '湘潭大学', '2024', '70667668@qq.com', '工程造价', 2402, '13101175551', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562624', '202405562624', '123456', '鲍云莲', 2, '湘潭大学', '2024', '5755460@qq.com', '工程造价', 2402, '13107734135', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562625', '202405562625', '123456', '穆贵福', 2, '湘潭大学', '2024', '423383@qq.com', '工程造价', 2402, '15504414364', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562626', '202405562626', '123456', '俞炎德', 2, '湘潭大学', '2024', '8233466@qq.com', '工程造价', 2402, '15706221571', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562627', '202405562627', '123456', '严强军', 2, '湘潭大学', '2024', '80833784@qq.com', '工程造价', 2402, '13005341016', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562628', '202405562628', '123456', '喻厚庆', 2, '湘潭大学', '2024', '5288248@qq.com', '工程造价', 2402, '15005760370', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562629', '202405562629', '123456', '祁天', 2, '湘潭大学', '2024', '37878688@qq.com', '工程造价', 2402, '15100151173', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405562630', '202405562630', '123456', '薛胜', 2, '湘潭大学', '2024', '0356800@qq.com', '工程造价', 2402, '13103442201', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563501', '202405563501', '123456', '汤士以', 2, '湘潭大学', '2024', '663755@qq.com', '网络工程', 2401, '15601252513', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563502', '202405563502', '123456', '姜馨', 2, '湘潭大学', '2024', '283885074@qq.com', '网络工程', 2401, '15601755361', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563503', '202405563503', '123456', '毕平保', 2, '湘潭大学', '2024', '638852@qq.com', '网络工程', 2401, '15503161000', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563504', '202405563504', '123456', '蒋涛', 2, '湘潭大学', '2024', '520872406@qq.com', '网络工程', 2401, '15101716151', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563505', '202405563505', '123456', '苏康星', 2, '湘潭大学', '2024', '67853544@qq.com', '网络工程', 2401, '15106743111', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563506', '202405563506', '123456', '赵英华', 2, '湘潭大学', '2024', '3882323@qq.com', '网络工程', 2401, '13705411042', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563507', '202405563507', '123456', '皮钧冠', 2, '湘潭大学', '2024', '3340370@qq.com', '网络工程', 2401, '13606112142', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563508', '202405563508', '123456', '阮功', 2, '湘潭大学', '2024', '000607@qq.com', '网络工程', 2401, '13203153310', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563509', '202405563509', '123456', '薛新', 2, '湘潭大学', '2024', '580276@qq.com', '网络工程', 2401, '13202115410', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563510', '202405563510', '123456', '章俊峰', 2, '湘潭大学', '2024', '282730@qq.com', '网络工程', 2401, '13502417476', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563511', '202405563511', '123456', '张秀娟', 2, '湘潭大学', '2024', '750428@qq.com', '网络工程', 2401, '15203111511', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563512', '202405563512', '123456', '计建家', 2, '湘潭大学', '2024', '30374668@qq.com', '网络工程', 2401, '13304451272', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563513', '202405563513', '123456', '时瑞凡', 2, '湘潭大学', '2024', '4343565@qq.com', '网络工程', 2401, '15701462511', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563514', '202405563514', '123456', '郎栋', 2, '湘潭大学', '2024', '33502@qq.com', '网络工程', 2401, '15707213272', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563515', '202405563515', '123456', '任勇毅', 2, '湘潭大学', '2024', '32073@qq.com', '网络工程', 2401, '13504573344', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563516', '202405563516', '123456', '昌克伦', 2, '湘潭大学', '2024', '3257563@qq.com', '网络工程', 2401, '15501016412', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563517', '202405563517', '123456', '计超', 2, '湘潭大学', '2024', '66030642@qq.com', '网络工程', 2401, '13203201154', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563518', '202405563518', '123456', '蒋芬芳', 2, '湘潭大学', '2024', '08053720@qq.com', '网络工程', 2401, '15107766531', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563519', '202405563519', '123456', '熊枫芸', 2, '湘潭大学', '2024', '445872@qq.com', '网络工程', 2401, '13400100200', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563520', '202405563520', '123456', '范浩亮', 2, '湘潭大学', '2024', '8400@qq.com', '网络工程', 2401, '13107121631', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563521', '202405563521', '123456', '臧馨', 2, '湘潭大学', '2024', '7805337@qq.com', '网络工程', 2401, '13406022561', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563522', '202405563522', '123456', '戴利清', 2, '湘潭大学', '2024', '4045038@qq.com', '网络工程', 2401, '13200037105', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563523', '202405563523', '123456', '湛博', 2, '湘潭大学', '2024', '07284533@qq.com', '网络工程', 2401, '13007677305', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563524', '202405563524', '123456', '邹淑', 2, '湘潭大学', '2024', '68585883@qq.com', '网络工程', 2401, '15506476352', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563525', '202405563525', '123456', '禹嘉', 2, '湘潭大学', '2024', '074885@qq.com', '网络工程', 2401, '13101771171', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563526', '202405563526', '123456', '萧仁', 2, '湘潭大学', '2024', '66544866@qq.com', '网络工程', 2401, '15101601340', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563527', '202405563527', '123456', '吕坚和', 2, '湘潭大学', '2024', '325820@qq.com', '网络工程', 2401, '13105165531', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563528', '202405563528', '123456', '许倩', 2, '湘潭大学', '2024', '377036487@qq.com', '网络工程', 2401, '15102131330', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563529', '202405563529', '123456', '喻士以', 2, '湘潭大学', '2024', '228025@qq.com', '网络工程', 2401, '15105126327', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563530', '202405563530', '123456', '苏胜', 2, '湘潭大学', '2024', '7042308@qq.com', '网络工程', 2401, '15003417161', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563531', '202405563531', '123456', '岑平保', 2, '湘潭大学', '2024', '067364226@qq.com', '网络工程', 2401, '13106575021', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563532', '202405563532', '123456', '贝颖', 2, '湘潭大学', '2024', '55062504@qq.com', '网络工程', 2401, '15101101001', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563533', '202405563533', '123456', '赵晓', 2, '湘潭大学', '2024', '040862@qq.com', '网络工程', 2401, '13606533115', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563534', '202405563534', '123456', '姜康星', 2, '湘潭大学', '2024', '74575@qq.com', '网络工程', 2401, '13001101117', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563535', '202405563535', '123456', '俞天', 2, '湘潭大学', '2024', '2435430@qq.com', '网络工程', 2401, '15501357410', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563536', '202405563536', '123456', '鲁彩', 2, '湘潭大学', '2024', '6356022@qq.com', '网络工程', 2401, '13406551154', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563537', '202405563537', '123456', '朱福', 2, '湘潭大学', '2024', '02733852@qq.com', '网络工程', 2401, '15104713617', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563538', '202405563538', '123456', '赵才发', 2, '湘潭大学', '2024', '47023303@qq.com', '网络工程', 2401, '13002710411', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563539', '202405563539', '123456', '窦义兴', 2, '湘潭大学', '2024', '7827352@qq.com', '网络工程', 2401, '15200133313', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563540', '202405563540', '123456', '郑永', 2, '湘潭大学', '2024', '2705740@qq.com', '网络工程', 2401, '15001114115', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563541', '202405563541', '123456', '康梁栋', 2, '湘潭大学', '2024', '6558467@qq.com', '网络工程', 2401, '15102453115', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563542', '202405563542', '123456', '岑梅', 2, '湘潭大学', '2024', '57258382@qq.com', '网络工程', 2401, '15103160726', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563543', '202405563543', '123456', '杨海', 2, '湘潭大学', '2024', '2380733@qq.com', '网络工程', 2401, '13407631067', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563544', '202405563544', '123456', '时腾', 2, '湘潭大学', '2024', '0630@qq.com', '网络工程', 2401, '13701174471', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563545', '202405563545', '123456', '席平保', 2, '湘潭大学', '2024', '53068407@qq.com', '网络工程', 2401, '13406474613', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563546', '202405563546', '123456', '柳和', 2, '湘潭大学', '2024', '244658@qq.com', '网络工程', 2401, '13600213411', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563547', '202405563547', '123456', '蓝鸣', 2, '湘潭大学', '2024', '050586@qq.com', '网络工程', 2401, '13704113761', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563548', '202405563548', '123456', '余进', 2, '湘潭大学', '2024', '8880463@qq.com', '网络工程', 2401, '13106543020', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563549', '202405563549', '123456', '伍言', 2, '湘潭大学', '2024', '744047447@qq.com', '网络工程', 2401, '13601144276', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563550', '202405563550', '123456', '尤克伦', 2, '湘潭大学', '2024', '622746@qq.com', '网络工程', 2401, '15206614057', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563601', '202405563601', '123456', '韦晨辰', 2, '湘潭大学', '2024', '522220@qq.com', '网络工程', 2402, '13104222241', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563602', '202405563602', '123456', '乐辰', 2, '湘潭大学', '2024', '3283547@qq.com', '网络工程', 2402, '13007113601', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563603', '202405563603', '123456', '纪安', 2, '湘潭大学', '2024', '6803565@qq.com', '网络工程', 2402, '13107164113', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563604', '202405563604', '123456', '阮英华', 2, '湘潭大学', '2024', '264372@qq.com', '网络工程', 2402, '13100616112', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563605', '202405563605', '123456', '项荷丹', 2, '湘潭大学', '2024', '64066733@qq.com', '网络工程', 2402, '13203615022', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563606', '202405563606', '123456', '彭雅', 2, '湘潭大学', '2024', '55054085@qq.com', '网络工程', 2402, '13706412111', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563607', '202405563607', '123456', '卫富顺', 2, '湘潭大学', '2024', '354246608@qq.com', '网络工程', 2402, '13706706132', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563608', '202405563608', '123456', '戚荣', 2, '湘潭大学', '2024', '7720044@qq.com', '网络工程', 2402, '13103707107', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563609', '202405563609', '123456', '方利清', 2, '湘潭大学', '2024', '5367344@qq.com', '网络工程', 2402, '15101430306', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563610', '202405563610', '123456', '魏楠榕', 2, '湘潭大学', '2024', '26875244@qq.com', '网络工程', 2402, '13501114717', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563611', '202405563611', '123456', '云红', 2, '湘潭大学', '2024', '0800247@qq.com', '网络工程', 2402, '15504155545', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563612', '202405563612', '123456', '和承乐', 2, '湘潭大学', '2024', '277257778@qq.com', '网络工程', 2402, '13000551455', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563613', '202405563613', '123456', '茅清', 2, '湘潭大学', '2024', '55662386@qq.com', '网络工程', 2402, '15202607107', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563614', '202405563614', '123456', '臧振壮', 2, '湘潭大学', '2024', '68026043@qq.com', '网络工程', 2402, '15300510531', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563615', '202405563615', '123456', '戴之', 2, '湘潭大学', '2024', '302538@qq.com', '网络工程', 2402, '15007732051', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563616', '202405563616', '123456', '倪利清', 2, '湘潭大学', '2024', '5220470@qq.com', '网络工程', 2402, '13507747313', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563617', '202405563617', '123456', '宋伟刚', 2, '湘潭大学', '2024', '765642426@qq.com', '网络工程', 2402, '15304761011', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563618', '202405563618', '123456', '周力', 2, '湘潭大学', '2024', '8520303@qq.com', '网络工程', 2402, '13006223571', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563619', '202405563619', '123456', '薛顺', 2, '湘潭大学', '2024', '86764278@qq.com', '网络工程', 2402, '13005106631', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563620', '202405563620', '123456', '闵纨仪', 2, '湘潭大学', '2024', '73688068@qq.com', '网络工程', 2402, '15002431337', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563621', '202405563621', '123456', '唐强军', 2, '湘潭大学', '2024', '0734380@qq.com', '网络工程', 2402, '13302364512', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563622', '202405563622', '123456', '滕芸', 2, '湘潭大学', '2024', '4774733@qq.com', '网络工程', 2402, '13105315035', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563623', '202405563623', '123456', '皮玲', 2, '湘潭大学', '2024', '22502272@qq.com', '网络工程', 2402, '15102251150', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563624', '202405563624', '123456', '方凡', 2, '湘潭大学', '2024', '4355835@qq.com', '网络工程', 2402, '13004331116', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563625', '202405563625', '123456', '孔文', 2, '湘潭大学', '2024', '3870438@qq.com', '网络工程', 2402, '15501027234', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563626', '202405563626', '123456', '魏星', 2, '湘潭大学', '2024', '066262083@qq.com', '网络工程', 2402, '13700252211', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563627', '202405563627', '123456', '顾叶', 2, '湘潭大学', '2024', '677700807@qq.com', '网络工程', 2402, '15505513724', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563628', '202405563628', '123456', '张祥', 2, '湘潭大学', '2024', '63853@qq.com', '网络工程', 2402, '15104701111', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563629', '202405563629', '123456', '毛炎德', 2, '湘潭大学', '2024', '888245026@qq.com', '网络工程', 2402, '13701411157', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563630', '202405563630', '123456', '华滢馥', 2, '湘潭大学', '2024', '22740682@qq.com', '网络工程', 2402, '13201743640', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563631', '202405563631', '123456', '卜影荔', 2, '湘潭大学', '2024', '32880046@qq.com', '网络工程', 2402, '13506015231', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563632', '202405563632', '123456', '蒋诚先', 2, '湘潭大学', '2024', '46026373@qq.com', '网络工程', 2402, '15104052140', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563633', '202405563633', '123456', '云固之', 2, '湘潭大学', '2024', '2273766@qq.com', '网络工程', 2402, '15305515022', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563634', '202405563634', '123456', '范富顺', 2, '湘潭大学', '2024', '32364422@qq.com', '网络工程', 2402, '13704227367', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563635', '202405563635', '123456', '窦晨辰', 2, '湘潭大学', '2024', '8850453@qq.com', '网络工程', 2402, '15106121376', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563636', '202405563636', '123456', '王毅', 2, '湘潭大学', '2024', '3837453@qq.com', '网络工程', 2402, '13304704727', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563637', '202405563637', '123456', '许谦', 2, '湘潭大学', '2024', '83440065@qq.com', '网络工程', 2402, '15703641020', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563638', '202405563638', '123456', '戴钧冠', 2, '湘潭大学', '2024', '207424@qq.com', '网络工程', 2402, '13204116441', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563639', '202405563639', '123456', '鲍全', 2, '湘潭大学', '2024', '562366@qq.com', '网络工程', 2402, '15101361467', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563640', '202405563640', '123456', '奚中', 2, '湘潭大学', '2024', '0685835@qq.com', '网络工程', 2402, '15201117621', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563701', '202405563701', '123456', '钱飘育', 2, '湘潭大学', '2024', '45060462@qq.com', '网络工程', 2403, '13603013155', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563702', '202405563702', '123456', '禹利清', 2, '湘潭大学', '2024', '307236422@qq.com', '网络工程', 2403, '15201276773', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563703', '202405563703', '123456', '喻启', 2, '湘潭大学', '2024', '50048644@qq.com', '网络工程', 2403, '13101441321', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563704', '202405563704', '123456', '伍鹏泽', 2, '湘潭大学', '2024', '04078587@qq.com', '网络工程', 2403, '13101301135', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563705', '202405563705', '123456', '昌翰', 2, '湘潭大学', '2024', '328232@qq.com', '网络工程', 2403, '15303144427', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563706', '202405563706', '123456', '贝翠雅', 2, '湘潭大学', '2024', '45866826@qq.com', '网络工程', 2403, '13001533007', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563707', '202405563707', '123456', '任莲', 2, '湘潭大学', '2024', '570256036@qq.com', '网络工程', 2403, '15302300312', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563708', '202405563708', '123456', '周国胜', 2, '湘潭大学', '2024', '7356205@qq.com', '网络工程', 2403, '13106221114', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563709', '202405563709', '123456', '褚元全', 2, '湘潭大学', '2024', '7276673@qq.com', '网络工程', 2403, '13103131104', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563710', '202405563710', '123456', '庞青倩', 2, '湘潭大学', '2024', '8852550@qq.com', '网络工程', 2403, '13205265116', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563711', '202405563711', '123456', '吕馨', 2, '湘潭大学', '2024', '73286865@qq.com', '网络工程', 2403, '15101515111', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563712', '202405563712', '123456', '项玲', 2, '湘潭大学', '2024', '203635766@qq.com', '网络工程', 2403, '15307336154', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563713', '202405563713', '123456', '戴钧冠', 2, '湘潭大学', '2024', '0308457@qq.com', '网络工程', 2403, '15201571224', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563714', '202405563714', '123456', '吴贞', 2, '湘潭大学', '2024', '5522345@qq.com', '网络工程', 2403, '13101017311', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563715', '202405563715', '123456', '湛可', 2, '湘潭大学', '2024', '78880608@qq.com', '网络工程', 2403, '13201311701', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563716', '202405563716', '123456', '金影荔', 2, '湘潭大学', '2024', '20347085@qq.com', '网络工程', 2403, '15004322175', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563717', '202405563717', '123456', '卞会思', 2, '湘潭大学', '2024', '252023@qq.com', '网络工程', 2403, '15701242611', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563718', '202405563718', '123456', '常苑', 2, '湘潭大学', '2024', '04507@qq.com', '网络工程', 2403, '13506117016', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563719', '202405563719', '123456', '明壮', 2, '湘潭大学', '2024', '33032@qq.com', '网络工程', 2403, '13002214152', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563720', '202405563720', '123456', '沈伦', 2, '湘潭大学', '2024', '25368255@qq.com', '网络工程', 2403, '15605204117', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563721', '202405563721', '123456', '邬裕', 2, '湘潭大学', '2024', '40530532@qq.com', '网络工程', 2403, '13404606651', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563722', '202405563722', '123456', '戴岚苑', 2, '湘潭大学', '2024', '0558256@qq.com', '网络工程', 2403, '13506546514', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563723', '202405563723', '123456', '贺雄琛', 2, '湘潭大学', '2024', '38483@qq.com', '网络工程', 2403, '15306127071', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563724', '202405563724', '123456', '花梦', 2, '湘潭大学', '2024', '8026884@qq.com', '网络工程', 2403, '13106401317', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563725', '202405563725', '123456', '马茂进', 2, '湘潭大学', '2024', '424@qq.com', '网络工程', 2403, '13703001331', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563726', '202405563726', '123456', '赵德', 2, '湘潭大学', '2024', '07425225@qq.com', '网络工程', 2403, '13503512561', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563727', '202405563727', '123456', '俞苑', 2, '湘潭大学', '2024', '8784502@qq.com', '网络工程', 2403, '15103167526', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563728', '202405563728', '123456', '薛才发', 2, '湘潭大学', '2024', '8256@qq.com', '网络工程', 2403, '15106112116', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563729', '202405563729', '123456', '祁山仁', 2, '湘潭大学', '2024', '6346887@qq.com', '网络工程', 2403, '15101162144', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563730', '202405563730', '123456', '秦环', 2, '湘潭大学', '2024', '354052@qq.com', '网络工程', 2403, '13101707235', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563731', '202405563731', '123456', '韩松善', 2, '湘潭大学', '2024', '6254755@qq.com', '网络工程', 2403, '13700117774', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563732', '202405563732', '123456', '梁毅', 2, '湘潭大学', '2024', '7430766@qq.com', '网络工程', 2403, '15100222062', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563733', '202405563733', '123456', '戚彩', 2, '湘潭大学', '2024', '43358642@qq.com', '网络工程', 2403, '15107076121', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563734', '202405563734', '123456', '狄轮翰', 2, '湘潭大学', '2024', '7672@qq.com', '网络工程', 2403, '15102474750', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563735', '202405563735', '123456', '张文', 2, '湘潭大学', '2024', '2652862@qq.com', '网络工程', 2403, '15103011177', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563736', '202405563736', '123456', '阮辰', 2, '湘潭大学', '2024', '362745556@qq.com', '网络工程', 2403, '13000741341', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563737', '202405563737', '123456', '戴启', 2, '湘潭大学', '2024', '82706600@qq.com', '网络工程', 2403, '15004066163', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563738', '202405563738', '123456', '纪功', 2, '湘潭大学', '2024', '0575863@qq.com', '网络工程', 2403, '15304254571', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563739', '202405563739', '123456', '柏震', 2, '湘潭大学', '2024', '40643@qq.com', '网络工程', 2403, '13102224710', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405563740', '202405563740', '123456', '朱茂进', 2, '湘潭大学', '2024', '458828@qq.com', '网络工程', 2403, '13507131714', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564501', '202405564501', '123456', '薛有', 2, '湘潭大学', '2024', '62644782@qq.com', '土木工程', 2401, '13101111612', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564502', '202405564502', '123456', '邵瑾颖', 2, '湘潭大学', '2024', '5602840@qq.com', '土木工程', 2401, '13607570611', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564503', '202405564503', '123456', '许梁栋', 2, '湘潭大学', '2024', '5857622@qq.com', '土木工程', 2401, '15100673026', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564504', '202405564504', '123456', '杜珍贞', 2, '湘潭大学', '2024', '5835574@qq.com', '土木工程', 2401, '13603046662', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564505', '202405564505', '123456', '计娜', 2, '湘潭大学', '2024', '654037@qq.com', '土木工程', 2401, '15201423116', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564506', '202405564506', '123456', '傅悦昭', 2, '湘潭大学', '2024', '55764664@qq.com', '土木工程', 2401, '13101101031', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564507', '202405564507', '123456', '陈亮', 2, '湘潭大学', '2024', '52586@qq.com', '土木工程', 2401, '13204516620', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564508', '202405564508', '123456', '和维启', 2, '湘潭大学', '2024', '8040782@qq.com', '土木工程', 2401, '15703470441', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564509', '202405564509', '123456', '谢朋斌', 2, '湘潭大学', '2024', '6777232@qq.com', '土木工程', 2401, '15307106665', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564510', '202405564510', '123456', '祁浩亮', 2, '湘潭大学', '2024', '75524223@qq.com', '土木工程', 2401, '15607122112', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564511', '202405564511', '123456', '褚飘育', 2, '湘潭大学', '2024', '8408340@qq.com', '土木工程', 2401, '13102471312', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564512', '202405564512', '123456', '酆保', 2, '湘潭大学', '2024', '7458645@qq.com', '土木工程', 2401, '15601171111', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564513', '202405564513', '123456', '殷艳', 2, '湘潭大学', '2024', '085632@qq.com', '土木工程', 2401, '15101611411', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564514', '202405564514', '123456', '蒋荣', 2, '湘潭大学', '2024', '73445056@qq.com', '土木工程', 2401, '15502114776', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564515', '202405564515', '123456', '赵斌', 2, '湘潭大学', '2024', '32558508@qq.com', '土木工程', 2401, '15102154172', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564516', '202405564516', '123456', '昌刚', 2, '湘潭大学', '2024', '8862376@qq.com', '土木工程', 2401, '13102011144', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564517', '202405564517', '123456', '酆韵融', 2, '湘潭大学', '2024', '46230505@qq.com', '土木工程', 2401, '15107331441', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564518', '202405564518', '123456', '卞亮', 2, '湘潭大学', '2024', '3528628@qq.com', '土木工程', 2401, '13403126440', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564519', '202405564519', '123456', '谢武新', 2, '湘潭大学', '2024', '702378@qq.com', '土木工程', 2401, '15201237571', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564520', '202405564520', '123456', '元竹霭', 2, '湘潭大学', '2024', '7853437@qq.com', '土木工程', 2401, '13100257311', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564521', '202405564521', '123456', '黄义兴', 2, '湘潭大学', '2024', '7368447@qq.com', '土木工程', 2401, '13102175120', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564522', '202405564522', '123456', '尹蓉眉', 2, '湘潭大学', '2024', '6382564@qq.com', '土木工程', 2401, '13406112710', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564523', '202405564523', '123456', '戴叶', 2, '湘潭大学', '2024', '4856232@qq.com', '土木工程', 2401, '13106166126', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564524', '202405564524', '123456', '皮坚和', 2, '湘潭大学', '2024', '572405833@qq.com', '土木工程', 2401, '15601627311', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564525', '202405564525', '123456', '马妍', 2, '湘潭大学', '2024', '55528464@qq.com', '土木工程', 2401, '13607167762', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564526', '202405564526', '123456', '倪永', 2, '湘潭大学', '2024', '55633850@qq.com', '土木工程', 2401, '13501137371', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564527', '202405564527', '123456', '狄爱妹', 2, '湘潭大学', '2024', '50377325@qq.com', '土木工程', 2401, '15100717017', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564528', '202405564528', '123456', '方先', 2, '湘潭大学', '2024', '42372003@qq.com', '土木工程', 2401, '15104113601', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564529', '202405564529', '123456', '褚世', 2, '湘潭大学', '2024', '3522325@qq.com', '土木工程', 2401, '13502713111', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405564530', '202405564530', '123456', '何伊亚', 2, '湘潭大学', '2024', '66725238@qq.com', '土木工程', 2401, '13601516601', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405565601', '202405565601', '123456', '陈小明', 2, '湘潭大学', '2024', '564387882@qq.com', '电子信息工程', 2401, '13351204423', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566501', '202405566501', '123456', '陈小明', 2, '湘潭大学', '2024', '564387882@qq.com', '电子信息工程', 1601, '13351204423', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566502', '202405566502', '123456', '谭小强', 2, '湘潭大学', '2024', '564387882@qq.com', '电子信息工程', 2401, '13104561561', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566503', '202405566503', '123456', '曹维启', 2, '湘潭大学', '2024', '363740@qq.com', '电子信息工程', 2401, '13700010121', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566504', '202405566504', '123456', '吕德', 2, '湘潭大学', '2024', '7206466@qq.com', '电子信息工程', 2401, '15103373621', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566505', '202405566505', '123456', '柏泽', 2, '湘潭大学', '2024', '030844828@qq.com', '电子信息工程', 2401, '13306440031', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566506', '202405566506', '123456', '熊辉力', 2, '湘潭大学', '2024', '3685763@qq.com', '电子信息工程', 2401, '13600165166', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566507', '202405566507', '123456', '傅冠', 2, '湘潭大学', '2024', '6334420@qq.com', '电子信息工程', 2401, '13701752016', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566508', '202405566508', '123456', '酆保', 2, '湘潭大学', '2024', '60323042@qq.com', '电子信息工程', 2401, '15200310443', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566509', '202405566509', '123456', '郑腾', 2, '湘潭大学', '2024', '05575@qq.com', '电子信息工程', 2401, '13103111152', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566510', '202405566510', '123456', '吴斌', 2, '湘潭大学', '2024', '26882036@qq.com', '电子信息工程', 2401, '13104042247', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566511', '202405566511', '123456', '柳慧巧', 2, '湘潭大学', '2024', '86670083@qq.com', '电子信息工程', 2401, '13704164341', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566512', '202405566512', '123456', '伏颖', 2, '湘潭大学', '2024', '8035523@qq.com', '电子信息工程', 2401, '13003751100', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566513', '202405566513', '123456', '鲍翔旭', 2, '湘潭大学', '2024', '336043@qq.com', '电子信息工程', 2401, '15105275012', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566514', '202405566514', '123456', '周泰盛', 2, '湘潭大学', '2024', '45773822@qq.com', '电子信息工程', 2401, '13605744115', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566515', '202405566515', '123456', '葛思', 2, '湘潭大学', '2024', '3434347@qq.com', '电子信息工程', 2401, '13102513003', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566516', '202405566516', '123456', '舒乐', 2, '湘潭大学', '2024', '720673668@qq.com', '电子信息工程', 2401, '13004250563', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566517', '202405566517', '123456', '孔月莺', 2, '湘潭大学', '2024', '8460727@qq.com', '电子信息工程', 2401, '13402175067', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566518', '202405566518', '123456', '姜斌', 2, '湘潭大学', '2024', '06402840@qq.com', '电子信息工程', 2401, '15301131611', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566519', '202405566519', '123456', '汪敬震', 2, '湘潭大学', '2024', '632228805@qq.com', '电子信息工程', 2401, '15704356031', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566520', '202405566520', '123456', '曹旭', 2, '湘潭大学', '2024', '8607467@qq.com', '电子信息工程', 2401, '13501641007', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566521', '202405566521', '123456', '柳影荔', 2, '湘潭大学', '2024', '8600234@qq.com', '电子信息工程', 2401, '13006514022', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566522', '202405566522', '123456', '蓝敬震', 2, '湘潭大学', '2024', '6427836@qq.com', '电子信息工程', 2401, '15001253413', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566523', '202405566523', '123456', '陈启', 2, '湘潭大学', '2024', '632837@qq.com', '电子信息工程', 2401, '15101024161', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566524', '202405566524', '123456', '严发', 2, '湘潭大学', '2024', '3775303@qq.com', '电子信息工程', 2401, '13402221141', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566525', '202405566525', '123456', '严强军', 2, '湘潭大学', '2024', '2833865@qq.com', '电子信息工程', 2401, '13501243126', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566526', '202405566526', '123456', '傅梅', 2, '湘潭大学', '2024', '5738850@qq.com', '电子信息工程', 2401, '13304411716', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566527', '202405566527', '123456', '齐莲', 2, '湘潭大学', '2024', '584875@qq.com', '电子信息工程', 2401, '13506746627', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566528', '202405566528', '123456', '邹燕彩', 2, '湘潭大学', '2024', '84482@qq.com', '电子信息工程', 2401, '15106244167', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566529', '202405566529', '123456', '滕承乐', 2, '湘潭大学', '2024', '64373866@qq.com', '电子信息工程', 2401, '15302411511', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566530', '202405566530', '123456', '吴翰', 2, '湘潭大学', '2024', '44353236@qq.com', '电子信息工程', 2401, '15106114741', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566531', '202405566531', '123456', '杨梦', 2, '湘潭大学', '2024', '2728205@qq.com', '电子信息工程', 2401, '13507047313', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566532', '202405566532', '123456', '尹厚庆', 2, '湘潭大学', '2024', '563536627@qq.com', '电子信息工程', 2401, '15300773435', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566533', '202405566533', '123456', '康莎', 2, '湘潭大学', '2024', '70302307@qq.com', '电子信息工程', 2401, '15602604715', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566534', '202405566534', '123456', '薛婉娴', 2, '湘潭大学', '2024', '75037403@qq.com', '电子信息工程', 2401, '15206754657', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566535', '202405566535', '123456', '毕强军', 2, '湘潭大学', '2024', '724302@qq.com', '电子信息工程', 2401, '13403206262', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566536', '202405566536', '123456', '孔雅', 2, '湘潭大学', '2024', '756085533@qq.com', '电子信息工程', 2401, '13406450046', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566537', '202405566537', '123456', '谈世', 2, '湘潭大学', '2024', '0647457@qq.com', '电子信息工程', 2401, '13307111421', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566538', '202405566538', '123456', '米勤', 2, '湘潭大学', '2024', '046766@qq.com', '电子信息工程', 2401, '15606114131', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566539', '202405566539', '123456', '水利清', 2, '湘潭大学', '2024', '7200038@qq.com', '电子信息工程', 2401, '15001216365', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566540', '202405566540', '123456', '昌飞彬', 2, '湘潭大学', '2024', '654302@qq.com', '电子信息工程', 2401, '13004151321', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566541', '202405566541', '123456', '范之', 2, '湘潭大学', '2024', '2063886@qq.com', '电子信息工程', 2401, '13500617610', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566542', '202405566542', '123456', '薛聪澜', 2, '湘潭大学', '2024', '6245266@qq.com', '电子信息工程', 2401, '13704104643', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566543', '202405566543', '123456', '蓝盛', 2, '湘潭大学', '2024', '335486@qq.com', '电子信息工程', 2401, '13005132500', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566544', '202405566544', '123456', '朱庆', 2, '湘潭大学', '2024', '706350@qq.com', '电子信息工程', 2401, '13107244171', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566545', '202405566545', '123456', '殷环', 2, '湘潭大学', '2024', '48684@qq.com', '电子信息工程', 2401, '13605745626', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566546', '202405566546', '123456', '水兴', 2, '湘潭大学', '2024', '73852533@qq.com', '电子信息工程', 2401, '13106661141', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566547', '202405566547', '123456', '姚言', 2, '湘潭大学', '2024', '4704574@qq.com', '电子信息工程', 2401, '13003310011', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566548', '202405566548', '123456', '邵震', 2, '湘潭大学', '2024', '475455334@qq.com', '电子信息工程', 2401, '13707631151', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566549', '202405566549', '123456', '史震', 2, '湘潭大学', '2024', '24778085@qq.com', '电子信息工程', 2401, '15607100436', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566550', '202405566550', '123456', '卞奇', 2, '湘潭大学', '2024', '2404227@qq.com', '电子信息工程', 2401, '13103720567', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566601', '202405566601', '123456', '范婉娴', 2, '湘潭大学', '2024', '7066785@qq.com', '电子信息工程', 2402, '15200665614', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566602', '202405566602', '123456', '廉善', 2, '湘潭大学', '2024', '67077805@qq.com', '电子信息工程', 2402, '15103017634', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566603', '202405566603', '123456', '倪士以', 2, '湘潭大学', '2024', '05246750@qq.com', '电子信息工程', 2402, '13202301117', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566604', '202405566604', '123456', '鲁梦', 2, '湘潭大学', '2024', '0656520@qq.com', '电子信息工程', 2402, '15701427421', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566605', '202405566605', '123456', '董素', 2, '湘潭大学', '2024', '63387005@qq.com', '电子信息工程', 2402, '13004617373', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566606', '202405566606', '123456', '孙山仁', 2, '湘潭大学', '2024', '46352855@qq.com', '电子信息工程', 2402, '13103714112', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566607', '202405566607', '123456', '贺山仁', 2, '湘潭大学', '2024', '285423@qq.com', '电子信息工程', 2402, '15707311051', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566608', '202405566608', '123456', '严成', 2, '湘潭大学', '2024', '7687340@qq.com', '电子信息工程', 2402, '13102565231', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566609', '202405566609', '123456', '袁邦', 2, '湘潭大学', '2024', '870438832@qq.com', '电子信息工程', 2402, '13101156211', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566610', '202405566610', '123456', '邵清', 2, '湘潭大学', '2024', '4053375@qq.com', '电子信息工程', 2402, '15302141611', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566611', '202405566611', '123456', '曹平保', 2, '湘潭大学', '2024', '7357382@qq.com', '电子信息工程', 2402, '13304641061', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566612', '202405566612', '123456', '邵天', 2, '湘潭大学', '2024', '42574087@qq.com', '电子信息工程', 2402, '15100521211', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566613', '202405566613', '123456', '卞振壮', 2, '湘潭大学', '2024', '7025057@qq.com', '电子信息工程', 2402, '15204103116', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566614', '202405566614', '123456', '袁政谦', 2, '湘潭大学', '2024', '4805454@qq.com', '电子信息工程', 2402, '15101671130', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566615', '202405566615', '123456', '于波宁', 2, '湘潭大学', '2024', '245580023@qq.com', '电子信息工程', 2402, '13701476173', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566616', '202405566616', '123456', '柏家', 2, '湘潭大学', '2024', '768323@qq.com', '电子信息工程', 2402, '15201043173', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566617', '202405566617', '123456', '葛德', 2, '湘潭大学', '2024', '7327877@qq.com', '电子信息工程', 2402, '15006110211', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566618', '202405566618', '123456', '王素', 2, '湘潭大学', '2024', '57005005@qq.com', '电子信息工程', 2402, '15005100117', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566619', '202405566619', '123456', '尹岚苑', 2, '湘潭大学', '2024', '0825326@qq.com', '电子信息工程', 2402, '13101404753', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566620', '202405566620', '123456', '滕树', 2, '湘潭大学', '2024', '357238@qq.com', '电子信息工程', 2402, '15103057271', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566621', '202405566621', '123456', '黄菁梦', 2, '湘潭大学', '2024', '0580535@qq.com', '电子信息工程', 2402, '13700171411', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566622', '202405566622', '123456', '安桂', 2, '湘潭大学', '2024', '47478072@qq.com', '电子信息工程', 2402, '15000117256', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566623', '202405566623', '123456', '邵波宁', 2, '湘潭大学', '2024', '2778557@qq.com', '电子信息工程', 2402, '13500517267', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566624', '202405566624', '123456', '米雄琛', 2, '湘潭大学', '2024', '500736436@qq.com', '电子信息工程', 2402, '15105237601', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566625', '202405566625', '123456', '昌全', 2, '湘潭大学', '2024', '2824060@qq.com', '电子信息工程', 2402, '15101716170', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566626', '202405566626', '123456', '明娴', 2, '湘潭大学', '2024', '385775220@qq.com', '电子信息工程', 2402, '15005352602', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566627', '202405566627', '123456', '梁咏卿', 2, '湘潭大学', '2024', '4386430@qq.com', '电子信息工程', 2402, '13604517122', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566628', '202405566628', '123456', '米富顺', 2, '湘潭大学', '2024', '7548265@qq.com', '电子信息工程', 2402, '13303637011', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566629', '202405566629', '123456', '韩飞彬', 2, '湘潭大学', '2024', '453876@qq.com', '电子信息工程', 2402, '13705117612', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566630', '202405566630', '123456', '钱明永', 2, '湘潭大学', '2024', '03252@qq.com', '电子信息工程', 2402, '15101123463', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566631', '202405566631', '123456', '纪宁', 2, '湘潭大学', '2024', '005752@qq.com', '电子信息工程', 2402, '15301157217', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566632', '202405566632', '123456', '陶坚和', 2, '湘潭大学', '2024', '742685@qq.com', '电子信息工程', 2402, '13300111425', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566633', '202405566633', '123456', '成晨辰', 2, '湘潭大学', '2024', '33006388@qq.com', '电子信息工程', 2402, '15101247675', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566634', '202405566634', '123456', '酆融', 2, '湘潭大学', '2024', '5722584@qq.com', '电子信息工程', 2402, '15004132761', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566635', '202405566635', '123456', '闵文', 2, '湘潭大学', '2024', '24367446@qq.com', '电子信息工程', 2402, '15605153713', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566636', '202405566636', '123456', '毛翔旭', 2, '湘潭大学', '2024', '6658502@qq.com', '电子信息工程', 2402, '15501176016', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566637', '202405566637', '123456', '戚豪', 2, '湘潭大学', '2024', '4847407@qq.com', '电子信息工程', 2402, '13104111406', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566638', '202405566638', '123456', '窦保', 2, '湘潭大学', '2024', '044585@qq.com', '电子信息工程', 2402, '13104422431', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566639', '202405566639', '123456', '殷力', 2, '湘潭大学', '2024', '87283@qq.com', '电子信息工程', 2402, '15700111146', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566640', '202405566640', '123456', '云琰', 2, '湘潭大学', '2024', '26885884@qq.com', '电子信息工程', 2402, '13203110110', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566641', '202405566641', '123456', '宋信子', 2, '湘潭大学', '2024', '6848065@qq.com', '电子信息工程', 2402, '13301151352', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566642', '202405566642', '123456', '喻梦', 2, '湘潭大学', '2024', '633455677@qq.com', '电子信息工程', 2402, '15107352571', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566643', '202405566643', '123456', '狄琳素', 2, '湘潭大学', '2024', '8225565@qq.com', '电子信息工程', 2402, '13605211327', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566644', '202405566644', '123456', '蓝岩中', 2, '湘潭大学', '2024', '5203470@qq.com', '电子信息工程', 2402, '15005721751', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566645', '202405566645', '123456', '潘琛', 2, '湘潭大学', '2024', '253640@qq.com', '电子信息工程', 2402, '15102333417', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566646', '202405566646', '123456', '余娣叶', 2, '湘潭大学', '2024', '84720780@qq.com', '电子信息工程', 2402, '13101311117', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566647', '202405566647', '123456', '谢克伦', 2, '湘潭大学', '2024', '3757525@qq.com', '电子信息工程', 2402, '15206410040', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566648', '202405566648', '123456', '昌冠', 2, '湘潭大学', '2024', '72022682@qq.com', '电子信息工程', 2402, '15303461002', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566649', '202405566649', '123456', '滕栋', 2, '湘潭大学', '2024', '660780624@qq.com', '电子信息工程', 2402, '15103267560', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566650', '202405566650', '123456', '曹河哲', 2, '湘潭大学', '2024', '658375@qq.com', '电子信息工程', 2402, '13001637635', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405566724', '202405566724', '123456', '林立川', 2, '湘潭大学', '2024', '532224308@qq.com', '电子信息工程', 2403, '13351204723', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567501', '202405567501', '123456', '席壮', 2, '湘潭大学', '2024', '6830004@qq.com', '物联网', 2401, '15103416551', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567502', '202405567502', '123456', '孙涛', 2, '湘潭大学', '2024', '828856@qq.com', '物联网', 2401, '13405007356', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567503', '202405567503', '123456', '俞翔旭', 2, '湘潭大学', '2024', '78804386@qq.com', '物联网', 2401, '15306101110', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567504', '202405567504', '123456', '汤璐', 2, '湘潭大学', '2024', '3540@qq.com', '物联网', 2401, '13303164030', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567505', '202405567505', '123456', '和菊', 2, '湘潭大学', '2024', '4882378@qq.com', '物联网', 2401, '13105636006', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567506', '202405567506', '123456', '乐邦', 2, '湘潭大学', '2024', '7885605@qq.com', '物联网', 2401, '15101332030', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567507', '202405567507', '123456', '袁林有', 2, '湘潭大学', '2024', '88742207@qq.com', '物联网', 2401, '13507104146', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567508', '202405567508', '123456', '穆博', 2, '湘潭大学', '2024', '42464323@qq.com', '物联网', 2401, '15702516501', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567509', '202405567509', '123456', '殷全', 2, '湘潭大学', '2024', '576737323@qq.com', '物联网', 2401, '13305743136', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567510', '202405567510', '123456', '卫飘育', 2, '湘潭大学', '2024', '8772876@qq.com', '物联网', 2401, '13403111166', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567511', '202405567511', '123456', '章之', 2, '湘潭大学', '2024', '0046283@qq.com', '物联网', 2401, '13603544101', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567512', '202405567512', '123456', '姜君琴', 2, '湘潭大学', '2024', '326823822@qq.com', '物联网', 2401, '15201164043', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567513', '202405567513', '123456', '袁茗', 2, '湘潭大学', '2024', '3568087@qq.com', '物联网', 2401, '15501015116', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567514', '202405567514', '123456', '戴震', 2, '湘潭大学', '2024', '26428062@qq.com', '物联网', 2401, '15101167731', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567515', '202405567515', '123456', '许策腾', 2, '湘潭大学', '2024', '668602@qq.com', '物联网', 2401, '13506343451', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567516', '202405567516', '123456', '陈莉桂', 2, '湘潭大学', '2024', '683765@qq.com', '物联网', 2401, '15106671011', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567517', '202405567517', '123456', '朱兴', 2, '湘潭大学', '2024', '26763667@qq.com', '物联网', 2401, '15302426153', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567518', '202405567518', '123456', '酆黛', 2, '湘潭大学', '2024', '8423543@qq.com', '物联网', 2401, '13601016005', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567519', '202405567519', '123456', '陶岚苑', 2, '湘潭大学', '2024', '6807053@qq.com', '物联网', 2401, '15003071111', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567520', '202405567520', '123456', '章坚和', 2, '湘潭大学', '2024', '4083208@qq.com', '物联网', 2401, '13603367311', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567521', '202405567521', '123456', '云芸', 2, '湘潭大学', '2024', '772644@qq.com', '物联网', 2401, '13100754201', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567522', '202405567522', '123456', '滕泰盛', 2, '湘潭大学', '2024', '46055603@qq.com', '物联网', 2401, '13500132241', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567523', '202405567523', '123456', '张莲', 2, '湘潭大学', '2024', '237832@qq.com', '物联网', 2401, '15003021260', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567524', '202405567524', '123456', '吴宜可', 2, '湘潭大学', '2024', '673300@qq.com', '物联网', 2401, '15104511074', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567525', '202405567525', '123456', '韩茜秋', 2, '湘潭大学', '2024', '6588874@qq.com', '物联网', 2401, '15202135736', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567526', '202405567526', '123456', '祝兰凤', 2, '湘潭大学', '2024', '84287836@qq.com', '物联网', 2401, '13403160525', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567527', '202405567527', '123456', '韩珠', 2, '湘潭大学', '2024', '06346828@qq.com', '物联网', 2401, '13104261355', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567528', '202405567528', '123456', '齐思', 2, '湘潭大学', '2024', '62830066@qq.com', '物联网', 2401, '15503013111', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567529', '202405567529', '123456', '祝飞彬', 2, '湘潭大学', '2024', '588650427@qq.com', '物联网', 2401, '13101151001', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567530', '202405567530', '123456', '尤刚', 2, '湘潭大学', '2024', '260605@qq.com', '物联网', 2401, '15102102066', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567531', '202405567531', '123456', '平寒', 2, '湘潭大学', '2024', '864880@qq.com', '物联网', 2401, '15704166215', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567532', '202405567532', '123456', '杨亮', 2, '湘潭大学', '2024', '24285463@qq.com', '物联网', 2401, '13107006331', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567533', '202405567533', '123456', '雷生龙', 2, '湘潭大学', '2024', '675436427@qq.com', '物联网', 2401, '13101126612', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567534', '202405567534', '123456', '康婕馨', 2, '湘潭大学', '2024', '767837707@qq.com', '物联网', 2401, '15600040516', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567535', '202405567535', '123456', '袁健世', 2, '湘潭大学', '2024', '706507@qq.com', '物联网', 2401, '13101545212', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567536', '202405567536', '123456', '梁莎', 2, '湘潭大学', '2024', '7856334@qq.com', '物联网', 2401, '13400511072', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567537', '202405567537', '123456', '湛军', 2, '湘潭大学', '2024', '308225520@qq.com', '物联网', 2401, '15503630132', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567538', '202405567538', '123456', '朱杰涛', 2, '湘潭大学', '2024', '55076606@qq.com', '物联网', 2401, '13104171530', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567539', '202405567539', '123456', '喻炎德', 2, '湘潭大学', '2024', '45363206@qq.com', '物联网', 2401, '15105347451', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567540', '202405567540', '123456', '尹月莺', 2, '湘潭大学', '2024', '68056@qq.com', '物联网', 2401, '15505211717', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567541', '202405567541', '123456', '茅民', 2, '湘潭大学', '2024', '7737206@qq.com', '物联网', 2401, '15204632454', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567542', '202405567542', '123456', '鲁健世', 2, '湘潭大学', '2024', '63428@qq.com', '物联网', 2401, '13206165601', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567543', '202405567543', '123456', '袁启', 2, '湘潭大学', '2024', '203540768@qq.com', '物联网', 2401, '13104415156', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567544', '202405567544', '123456', '滕朋斌', 2, '湘潭大学', '2024', '632348680@qq.com', '物联网', 2401, '15103052507', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567545', '202405567545', '123456', '董顺', 2, '湘潭大学', '2024', '6685387@qq.com', '物联网', 2401, '13102514245', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567546', '202405567546', '123456', '苏辉力', 2, '湘潭大学', '2024', '07038636@qq.com', '物联网', 2401, '15107111147', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567547', '202405567547', '123456', '贝厚庆', 2, '湘潭大学', '2024', '74727700@qq.com', '物联网', 2401, '15607121314', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567548', '202405567548', '123456', '卞健世', 2, '湘潭大学', '2024', '2454326@qq.com', '物联网', 2401, '15005216176', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567549', '202405567549', '123456', '伍会思', 2, '湘潭大学', '2024', '7757387@qq.com', '物联网', 2401, '15007517312', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405567550', '202405567550', '123456', '陈伯', 2, '湘潭大学', '2024', '7030528@qq.com', '物联网', 2401, '13605141004', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568501', '202405568501', '123456', '元才发', 2, '湘潭大学', '2024', '0028434@qq.com', '计算机', 2401, '13103547031', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568502', '202405568502', '123456', '余伯', 2, '湘潭大学', '2024', '4838006@qq.com', '计算机', 2401, '15604376436', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568503', '202405568503', '123456', '云光天', 2, '湘潭大学', '2024', '8773608@qq.com', '计算机', 2401, '15502165043', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568504', '202405568504', '123456', '傅珊莎', 2, '湘潭大学', '2024', '43065623@qq.com', '计算机', 2401, '15606345572', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568505', '202405568505', '123456', '唐强军', 2, '湘潭大学', '2024', '80042463@qq.com', '计算机', 2401, '13602120114', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568506', '202405568506', '123456', '卞军', 2, '湘潭大学', '2024', '037708204@qq.com', '计算机', 2401, '15704135123', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568507', '202405568507', '123456', '苏乐', 2, '湘潭大学', '2024', '777055@qq.com', '计算机', 2401, '13101171576', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568508', '202405568508', '123456', '宋超', 2, '湘潭大学', '2024', '6038@qq.com', '计算机', 2401, '15101237351', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568509', '202405568509', '123456', '朱馥', 2, '湘潭大学', '2024', '2682566@qq.com', '计算机', 2401, '13000117111', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568510', '202405568510', '123456', '屈波宁', 2, '湘潭大学', '2024', '77072608@qq.com', '计算机', 2401, '15101110411', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568511', '202405568511', '123456', '葛莲', 2, '湘潭大学', '2024', '2547643@qq.com', '计算机', 2401, '13200454507', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568512', '202405568512', '123456', '孙荔', 2, '湘潭大学', '2024', '307744267@qq.com', '计算机', 2401, '13704534046', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568513', '202405568513', '123456', '花武新', 2, '湘潭大学', '2024', '6208@qq.com', '计算机', 2401, '15101323376', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568514', '202405568514', '123456', '伏振壮', 2, '湘潭大学', '2024', '840352630@qq.com', '计算机', 2401, '15706043432', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568515', '202405568515', '123456', '茅岩中', 2, '湘潭大学', '2024', '602568244@qq.com', '计算机', 2401, '13002166031', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568516', '202405568516', '123456', '倪辰', 2, '湘潭大学', '2024', '3587273@qq.com', '计算机', 2401, '13603716371', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568517', '202405568517', '123456', '史元全', 2, '湘潭大学', '2024', '7240860@qq.com', '计算机', 2401, '13602112506', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568518', '202405568518', '123456', '宋磊民', 2, '湘潭大学', '2024', '46503570@qq.com', '计算机', 2401, '15102111171', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568519', '202405568519', '123456', '祁纯毓', 2, '湘潭大学', '2024', '06652047@qq.com', '计算机', 2401, '15101573157', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568520', '202405568520', '123456', '殷融', 2, '湘潭大学', '2024', '376766@qq.com', '计算机', 2401, '13405113627', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568521', '202405568521', '123456', '米健世', 2, '湘潭大学', '2024', '7874387@qq.com', '计算机', 2401, '13003773456', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568522', '202405568522', '123456', '明秀娟', 2, '湘潭大学', '2024', '404654@qq.com', '计算机', 2401, '13404210152', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568523', '202405568523', '123456', '窦娣叶', 2, '湘潭大学', '2024', '000425@qq.com', '计算机', 2401, '13100236570', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568524', '202405568524', '123456', '计冰爽', 2, '湘潭大学', '2024', '60604523@qq.com', '计算机', 2401, '15702601224', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568525', '202405568525', '123456', '谈舒', 2, '湘潭大学', '2024', '20862865@qq.com', '计算机', 2401, '15003111062', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568526', '202405568526', '123456', '顾眉', 2, '湘潭大学', '2024', '0748352@qq.com', '计算机', 2401, '15107212411', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568527', '202405568527', '123456', '褚新', 2, '湘潭大学', '2024', '8080408@qq.com', '计算机', 2401, '15605121061', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568528', '202405568528', '123456', '周春菊', 2, '湘潭大学', '2024', '6626578@qq.com', '计算机', 2401, '13005120217', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568529', '202405568529', '123456', '熊晓', 2, '湘潭大学', '2024', '2255760@qq.com', '计算机', 2401, '15301567262', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568530', '202405568530', '123456', '余岚苑', 2, '湘潭大学', '2024', '67743723@qq.com', '计算机', 2401, '15304301001', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568531', '202405568531', '123456', '汪咏卿', 2, '湘潭大学', '2024', '60374@qq.com', '计算机', 2401, '13001315171', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568532', '202405568532', '123456', '屈红', 2, '湘潭大学', '2024', '7655534@qq.com', '计算机', 2401, '13301531314', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568533', '202405568533', '123456', '邹生龙', 2, '湘潭大学', '2024', '0247336@qq.com', '计算机', 2401, '13605362553', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568534', '202405568534', '123456', '倪山仁', 2, '湘潭大学', '2024', '28336670@qq.com', '计算机', 2401, '15105316257', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568535', '202405568535', '123456', '喻坚和', 2, '湘潭大学', '2024', '54625485@qq.com', '计算机', 2401, '13601155055', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568536', '202405568536', '123456', '戚盛', 2, '湘潭大学', '2024', '3362203@qq.com', '计算机', 2401, '15606701614', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568537', '202405568537', '123456', '乐发', 2, '湘潭大学', '2024', '520252@qq.com', '计算机', 2401, '13002170510', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568538', '202405568538', '123456', '韦星', 2, '湘潭大学', '2024', '227747@qq.com', '计算机', 2401, '15201574165', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568539', '202405568539', '123456', '唐明永', 2, '湘潭大学', '2024', '5882878@qq.com', '计算机', 2401, '13507304125', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568540', '202405568540', '123456', '曹辉力', 2, '湘潭大学', '2024', '3728620@qq.com', '计算机', 2401, '15600431231', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568541', '202405568541', '123456', '杜楠榕', 2, '湘潭大学', '2024', '6276064@qq.com', '计算机', 2401, '13602362112', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568542', '202405568542', '123456', '苗彬', 2, '湘潭大学', '2024', '3262345@qq.com', '计算机', 2401, '13201425231', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568543', '202405568543', '123456', '任丹', 2, '湘潭大学', '2024', '46085077@qq.com', '计算机', 2401, '15101123441', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568544', '202405568544', '123456', '朱真环', 2, '湘潭大学', '2024', '33666503@qq.com', '计算机', 2401, '13701317411', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568545', '202405568545', '123456', '喻欣', 2, '湘潭大学', '2024', '764076576@qq.com', '计算机', 2401, '13104310311', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568546', '202405568546', '123456', '杜进', 2, '湘潭大学', '2024', '80742356@qq.com', '计算机', 2401, '15307761012', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568547', '202405568547', '123456', '费国胜', 2, '湘潭大学', '2024', '75333222@qq.com', '计算机', 2401, '13004227751', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568548', '202405568548', '123456', '计有', 2, '湘潭大学', '2024', '657377@qq.com', '计算机', 2401, '15300275062', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568549', '202405568549', '123456', '沈梁栋', 2, '湘潭大学', '2024', '3788007@qq.com', '计算机', 2401, '15203263114', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568550', '202405568550', '123456', '臧艺', 2, '湘潭大学', '2024', '072722366@qq.com', '计算机', 2401, '15700102116', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568551', '202405568551', '123456', '邹伟刚', 2, '湘潭大学', '2024', '66302636@qq.com', '计算机', 2401, '13200214112', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568552', '202405568552', '123456', '鲍刚', 2, '湘潭大学', '2024', '66460248@qq.com', '计算机', 2401, '13101224032', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568553', '202405568553', '123456', '萧俊峰', 2, '湘潭大学', '2024', '67656450@qq.com', '计算机', 2401, '13206005405', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568554', '202405568554', '123456', '臧梁栋', 2, '湘潭大学', '2024', '0525554@qq.com', '计算机', 2401, '15506107247', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568555', '202405568555', '123456', '祝子', 2, '湘潭大学', '2024', '6480540@qq.com', '计算机', 2401, '13304710554', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568556', '202405568556', '123456', '沈盛', 2, '湘潭大学', '2024', '55856647@qq.com', '计算机', 2401, '13706062577', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568557', '202405568557', '123456', '谢叶', 2, '湘潭大学', '2024', '504350004@qq.com', '计算机', 2401, '13204126541', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568558', '202405568558', '123456', '鲁咏卿', 2, '湘潭大学', '2024', '6528558@qq.com', '计算机', 2401, '13601542151', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568559', '202405568559', '123456', '曹倩', 2, '湘潭大学', '2024', '044425487@qq.com', '计算机', 2401, '13601100215', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405568560', '202405568560', '123456', '戴峰', 2, '湘潭大学', '2024', '206727@qq.com', '计算机', 2401, '15106011572', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569501', '202405569501', '123456', '赵浩亮', 2, '湘潭大学', '2024', '5543003@qq.com', '通信工程', 2401, '13505125127', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569502', '202405569502', '123456', '卞菲寒', 2, '湘潭大学', '2024', '0507423@qq.com', '通信工程', 2401, '15104104127', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569503', '202405569503', '123456', '葛家', 2, '湘潭大学', '2024', '586860@qq.com', '通信工程', 2401, '13604445141', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569504', '202405569504', '123456', '吕嘉', 2, '湘潭大学', '2024', '827286844@qq.com', '通信工程', 2401, '15205651114', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569505', '202405569505', '123456', '邬清', 2, '湘潭大学', '2024', '25546362@qq.com', '通信工程', 2401, '13007441071', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569506', '202405569506', '123456', '苏学祥', 2, '湘潭大学', '2024', '054344@qq.com', '通信工程', 2401, '15201054214', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569507', '202405569507', '123456', '马芝玉', 2, '湘潭大学', '2024', '0336462@qq.com', '通信工程', 2401, '15200115470', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569508', '202405569508', '123456', '云敬震', 2, '湘潭大学', '2024', '88044268@qq.com', '通信工程', 2401, '13001260731', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569509', '202405569509', '123456', '宋全', 2, '湘潭大学', '2024', '6668026@qq.com', '通信工程', 2401, '13007711613', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569510', '202405569510', '123456', '康苑', 2, '湘潭大学', '2024', '8824645@qq.com', '通信工程', 2401, '13604136676', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569511', '202405569511', '123456', '尹羽希', 2, '湘潭大学', '2024', '3566072@qq.com', '通信工程', 2401, '13307140205', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569512', '202405569512', '123456', '鲍义兴', 2, '湘潭大学', '2024', '602030447@qq.com', '通信工程', 2401, '15204166171', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569513', '202405569513', '123456', '云清', 2, '湘潭大学', '2024', '0047088@qq.com', '通信工程', 2401, '13603440102', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569514', '202405569514', '123456', '戴娟', 2, '湘潭大学', '2024', '46226548@qq.com', '通信工程', 2401, '13103517716', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569515', '202405569515', '123456', '汪福', 2, '湘潭大学', '2024', '8668662@qq.com', '通信工程', 2401, '15205717430', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569516', '202405569516', '123456', '屈泽', 2, '湘潭大学', '2024', '424625@qq.com', '通信工程', 2401, '13104365111', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569517', '202405569517', '123456', '李滢馥', 2, '湘潭大学', '2024', '58058@qq.com', '通信工程', 2401, '13607116617', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569518', '202405569518', '123456', '方超', 2, '湘潭大学', '2024', '085888464@qq.com', '通信工程', 2401, '13404356120', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569519', '202405569519', '123456', '陈昌成', 2, '湘潭大学', '2024', '4523650@qq.com', '通信工程', 2401, '15102104161', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569520', '202405569520', '123456', '纪炎德', 2, '湘潭大学', '2024', '0824778@qq.com', '通信工程', 2401, '15306760115', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569521', '202405569521', '123456', '吕龙', 2, '湘潭大学', '2024', '74607746@qq.com', '通信工程', 2401, '15000545035', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569522', '202405569522', '123456', '苗巧', 2, '湘潭大学', '2024', '34645763@qq.com', '通信工程', 2401, '15507556313', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569523', '202405569523', '123456', '杜澜', 2, '湘潭大学', '2024', '588336@qq.com', '通信工程', 2401, '13604614114', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569524', '202405569524', '123456', '熊世', 2, '湘潭大学', '2024', '2257766@qq.com', '通信工程', 2401, '13500174571', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569525', '202405569525', '123456', '安泰盛', 2, '湘潭大学', '2024', '44685775@qq.com', '通信工程', 2401, '15107175617', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569526', '202405569526', '123456', '鲍山仁', 2, '湘潭大学', '2024', '446402@qq.com', '通信工程', 2401, '13605760012', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569527', '202405569527', '123456', '任英华', 2, '湘潭大学', '2024', '0764842@qq.com', '通信工程', 2401, '15503136113', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569528', '202405569528', '123456', '成仪', 2, '湘潭大学', '2024', '265244@qq.com', '通信工程', 2401, '15302111655', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569529', '202405569529', '123456', '杜固之', 2, '湘潭大学', '2024', '45006024@qq.com', '通信工程', 2401, '15001304711', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569530', '202405569530', '123456', '茅成', 2, '湘潭大学', '2024', '7370545@qq.com', '通信工程', 2401, '13100152710', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569531', '202405569531', '123456', '于磊民', 2, '湘潭大学', '2024', '635777568@qq.com', '通信工程', 2401, '15607131125', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569532', '202405569532', '123456', '柳芳', 2, '湘潭大学', '2024', '83048405@qq.com', '通信工程', 2401, '13706150561', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569533', '202405569533', '123456', '余海', 2, '湘潭大学', '2024', '0545535@qq.com', '通信工程', 2401, '13704111330', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569534', '202405569534', '123456', '卞霞香', 2, '湘潭大学', '2024', '33425034@qq.com', '通信工程', 2401, '13100410633', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569535', '202405569535', '123456', '倪学祥', 2, '湘潭大学', '2024', '63207@qq.com', '通信工程', 2401, '15107555110', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569536', '202405569536', '123456', '严琦', 2, '湘潭大学', '2024', '522036@qq.com', '通信工程', 2401, '13106321112', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569537', '202405569537', '123456', '余时', 2, '湘潭大学', '2024', '23670430@qq.com', '通信工程', 2401, '13201510511', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569538', '202405569538', '123456', '凤亚', 2, '湘潭大学', '2024', '28274883@qq.com', '通信工程', 2401, '15301276714', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569539', '202405569539', '123456', '褚言', 2, '湘潭大学', '2024', '706304654@qq.com', '通信工程', 2401, '15701360641', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569540', '202405569540', '123456', '禹发', 2, '湘潭大学', '2024', '550503222@qq.com', '通信工程', 2401, '15101251141', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569541', '202405569541', '123456', '彭亚', 2, '湘潭大学', '2024', '76426868@qq.com', '通信工程', 2401, '13706551100', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569542', '202405569542', '123456', '赵若鸣', 2, '湘潭大学', '2024', '0043453@qq.com', '通信工程', 2401, '13500516474', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569543', '202405569543', '123456', '苏振壮', 2, '湘潭大学', '2024', '2860250@qq.com', '通信工程', 2401, '13007713265', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569544', '202405569544', '123456', '魏君琴', 2, '湘潭大学', '2024', '87533205@qq.com', '通信工程', 2401, '15603145611', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569545', '202405569545', '123456', '阮清', 2, '湘潭大学', '2024', '326254034@qq.com', '通信工程', 2401, '13101556712', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569546', '202405569546', '123456', '陶仪', 2, '湘潭大学', '2024', '4444546@qq.com', '通信工程', 2401, '15102571553', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569547', '202405569547', '123456', '孙江超', 2, '湘潭大学', '2024', '08272400@qq.com', '通信工程', 2401, '13300015346', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569548', '202405569548', '123456', '罗保', 2, '湘潭大学', '2024', '32362442@qq.com', '通信工程', 2401, '15307366157', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569549', '202405569549', '123456', '陈菁梦', 2, '湘潭大学', '2024', '6066357@qq.com', '通信工程', 2401, '15503606222', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569550', '202405569550', '123456', '陶之', 2, '湘潭大学', '2024', '73807004@qq.com', '通信工程', 2401, '15101411100', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569551', '202405569551', '123456', '贝菲寒', 2, '湘潭大学', '2024', '6732346@qq.com', '通信工程', 2401, '13301142610', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569552', '202405569552', '123456', '茅士以', 2, '湘潭大学', '2024', '268@qq.com', '通信工程', 2401, '13104657113', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569553', '202405569553', '123456', '湛先', 2, '湘潭大学', '2024', '05028534@qq.com', '通信工程', 2401, '13101004234', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569554', '202405569554', '123456', '纪思', 2, '湘潭大学', '2024', '507633347@qq.com', '通信工程', 2401, '13403136011', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569555', '202405569555', '123456', '杜广志', 2, '湘潭大学', '2024', '850684@qq.com', '通信工程', 2401, '15202426310', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569556', '202405569556', '123456', '王伯', 2, '湘潭大学', '2024', '03680246@qq.com', '通信工程', 2401, '13406052420', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569557', '202405569557', '123456', '奚翔旭', 2, '湘潭大学', '2024', '466068504@qq.com', '通信工程', 2401, '15601417114', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569558', '202405569558', '123456', '谈东文', 2, '湘潭大学', '2024', '04342337@qq.com', '通信工程', 2401, '13204147151', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569559', '202405569559', '123456', '萧亮', 2, '湘潭大学', '2024', '8078085@qq.com', '通信工程', 2401, '13500513100', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569560', '202405569560', '123456', '唐新', 2, '湘潭大学', '2024', '5562638@qq.com', '通信工程', 2401, '15005461001', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569601', '202405569601', '123456', '唐康星', 2, '湘潭大学', '2024', '7726447@qq.com', '通信工程', 2402, '13100714145', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569602', '202405569602', '123456', '薛毅', 2, '湘潭大学', '2024', '278825856@qq.com', '通信工程', 2402, '13002133174', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569603', '202405569603', '123456', '陈博', 2, '湘潭大学', '2024', '405253@qq.com', '通信工程', 2402, '13601750116', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569604', '202405569604', '123456', '许林有', 2, '湘潭大学', '2024', '8244074@qq.com', '通信工程', 2402, '13004111461', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569605', '202405569605', '123456', '戴富顺', 2, '湘潭大学', '2024', '673778@qq.com', '通信工程', 2402, '13103532316', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569606', '202405569606', '123456', '窦义兴', 2, '湘潭大学', '2024', '2454788@qq.com', '通信工程', 2402, '15101022144', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569607', '202405569607', '123456', '殷梅', 2, '湘潭大学', '2024', '38004633@qq.com', '通信工程', 2402, '15300113101', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569608', '202405569608', '123456', '黄固之', 2, '湘潭大学', '2024', '760363306@qq.com', '通信工程', 2402, '15607603244', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569609', '202405569609', '123456', '闵红', 2, '湘潭大学', '2024', '774578248@qq.com', '通信工程', 2402, '15106115153', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569610', '202405569610', '123456', '袁君琴', 2, '湘潭大学', '2024', '435554445@qq.com', '通信工程', 2402, '15607716076', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569611', '202405569611', '123456', '华翰', 2, '湘潭大学', '2024', '737784743@qq.com', '通信工程', 2402, '15101611233', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569612', '202405569612', '123456', '岑伊亚', 2, '湘潭大学', '2024', '85240438@qq.com', '通信工程', 2402, '15606441224', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569613', '202405569613', '123456', '曹维启', 2, '湘潭大学', '2024', '76600@qq.com', '通信工程', 2402, '13103145331', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569614', '202405569614', '123456', '蓝时', 2, '湘潭大学', '2024', '84087@qq.com', '通信工程', 2402, '13202367671', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569615', '202405569615', '123456', '朱影荔', 2, '湘潭大学', '2024', '630578@qq.com', '通信工程', 2402, '13100105004', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569616', '202405569616', '123456', '茅祥', 2, '湘潭大学', '2024', '36767242@qq.com', '通信工程', 2402, '13307565071', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569617', '202405569617', '123456', '尤群豪', 2, '湘潭大学', '2024', '5845387@qq.com', '通信工程', 2402, '13407666012', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569618', '202405569618', '123456', '曹利清', 2, '湘潭大学', '2024', '42053525@qq.com', '通信工程', 2402, '15207016014', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569619', '202405569619', '123456', '袁子', 2, '湘潭大学', '2024', '7802524@qq.com', '通信工程', 2402, '13107130151', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569620', '202405569620', '123456', '祁刚', 2, '湘潭大学', '2024', '453023620@qq.com', '通信工程', 2402, '15305143563', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569621', '202405569621', '123456', '戚武新', 2, '湘潭大学', '2024', '73223506@qq.com', '通信工程', 2402, '15303145132', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569622', '202405569622', '123456', '曹荷丹', 2, '湘潭大学', '2024', '550585254@qq.com', '通信工程', 2402, '13707115335', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569623', '202405569623', '123456', '严斌', 2, '湘潭大学', '2024', '780674@qq.com', '通信工程', 2402, '13100210142', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569624', '202405569624', '123456', '彭苑', 2, '湘潭大学', '2024', '206770@qq.com', '通信工程', 2402, '13206516167', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569625', '202405569625', '123456', '鲁晨辰', 2, '湘潭大学', '2024', '68464228@qq.com', '通信工程', 2402, '15502376511', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569626', '202405569626', '123456', '苏秀娟', 2, '湘潭大学', '2024', '0308234@qq.com', '通信工程', 2402, '15101111013', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569627', '202405569627', '123456', '柳美娜', 2, '湘潭大学', '2024', '0544372@qq.com', '通信工程', 2402, '15705426277', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569628', '202405569628', '123456', '齐致树', 2, '湘潭大学', '2024', '008@qq.com', '通信工程', 2402, '15603112122', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569629', '202405569629', '123456', '庞生龙', 2, '湘潭大学', '2024', '5072878@qq.com', '通信工程', 2402, '13706132275', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569630', '202405569630', '123456', '奚贵福', 2, '湘潭大学', '2024', '7082666@qq.com', '通信工程', 2402, '15305125752', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569631', '202405569631', '123456', '吴武新', 2, '湘潭大学', '2024', '20220332@qq.com', '通信工程', 2402, '13601671000', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569632', '202405569632', '123456', '祝辉力', 2, '湘潭大学', '2024', '47607876@qq.com', '通信工程', 2402, '13204133213', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569633', '202405569633', '123456', '陈成', 2, '湘潭大学', '2024', '480586@qq.com', '通信工程', 2402, '13001115135', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569634', '202405569634', '123456', '史壮', 2, '湘潭大学', '2024', '47568@qq.com', '通信工程', 2402, '15301550166', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569635', '202405569635', '123456', '孙行时', 2, '湘潭大学', '2024', '4574365@qq.com', '通信工程', 2402, '13400414101', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569636', '202405569636', '123456', '倪君琴', 2, '湘潭大学', '2024', '2056535@qq.com', '通信工程', 2402, '15103543311', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569637', '202405569637', '123456', '柳怡婵', 2, '湘潭大学', '2024', '30555467@qq.com', '通信工程', 2402, '13503267307', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569638', '202405569638', '123456', '元元全', 2, '湘潭大学', '2024', '48020@qq.com', '通信工程', 2402, '15701543114', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569639', '202405569639', '123456', '施谦', 2, '湘潭大学', '2024', '0866222@qq.com', '通信工程', 2402, '15601576505', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569640', '202405569640', '123456', '时凤', 2, '湘潭大学', '2024', '02557574@qq.com', '通信工程', 2402, '15105311550', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569641', '202405569641', '123456', '张固之', 2, '湘潭大学', '2024', '530470@qq.com', '通信工程', 2402, '15201713721', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569642', '202405569642', '123456', '范梁栋', 2, '湘潭大学', '2024', '77246@qq.com', '通信工程', 2402, '15202124411', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569643', '202405569643', '123456', '任舒', 2, '湘潭大学', '2024', '4430745@qq.com', '通信工程', 2402, '13502407271', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569644', '202405569644', '123456', '郑会思', 2, '湘潭大学', '2024', '657385833@qq.com', '通信工程', 2402, '15105611002', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569645', '202405569645', '123456', '严娜', 2, '湘潭大学', '2024', '305385326@qq.com', '通信工程', 2402, '15502555116', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569646', '202405569646', '123456', '沈子', 2, '湘潭大学', '2024', '5434277@qq.com', '通信工程', 2402, '15205126176', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569647', '202405569647', '123456', '齐辰', 2, '湘潭大学', '2024', '4805606@qq.com', '通信工程', 2402, '15005217151', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569648', '202405569648', '123456', '葛才发', 2, '湘潭大学', '2024', '325730@qq.com', '通信工程', 2402, '13107017122', 1, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569649', '202405569649', '123456', '雷晨辰', 2, '湘潭大学', '2024', '672657273@qq.com', '通信工程', 2402, '13004411366', 0, '2023-03-31 15:50:22');
INSERT INTO `student` VALUES ('202405569650', '202405569650', '123456', '姚强军', 2, '湘潭大学', '2024', '582838@qq.com', '通信工程', 2402, '13407660717', 0, '2023-03-31 15:50:22');

-- ----------------------------
-- Table structure for student_course
-- ----------------------------
DROP TABLE IF EXISTS `student_course`;
CREATE TABLE `student_course`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `student_id` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `course_id` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `score` varchar(11) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `point` decimal(4, 2) NOT NULL,
  `credits` decimal(4, 2) NOT NULL,
  `term` tinyint NOT NULL,
  `year` int NOT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `sc_student`(`student_id` ASC) USING BTREE,
  INDEX `sc_course`(`course_id` ASC) USING BTREE,
  CONSTRAINT `sc_course` FOREIGN KEY (`course_id`) REFERENCES `course` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE,
  CONSTRAINT `sc_student` FOREIGN KEY (`student_id`) REFERENCES `student` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE = InnoDB AUTO_INCREMENT = 475 CHARACTER SET = utf8mb3 COLLATE = utf8mb3_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of student_course
-- ----------------------------
INSERT INTO `student_course` VALUES (1, '202405565601', '2024011001', '数字电路基础', '75', 2.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (2, '202405566502', '2024011001', '数字电路基础', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (3, '202405566503', '2024011001', '数字电路基础', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (4, '202405566504', '2024011001', '数字电路基础', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (5, '202405566505', '2024011001', '数字电路基础', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (6, '202405566506', '2024011001', '数字电路基础', '98', 4.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (7, '202405566507', '2024011001', '数字电路基础', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (8, '202405566508', '2024011001', '数字电路基础', '55', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (9, '202405566509', '2024011001', '数字电路基础', '67', 1.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (10, '202405566510', '2024011001', '数字电路基础', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (11, '202405566511', '2024011001', '数字电路基础', '32', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (12, '202405566512', '2024011001', '数字电路基础', '43', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (13, '202405566513', '2024011001', '数字电路基础', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (14, '202405566514', '2024011001', '数字电路基础', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (15, '202405566515', '2024011001', '数字电路基础', '23', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (16, '202405566516', '2024011001', '数字电路基础', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (17, '202405566517', '2024011001', '数字电路基础', '64', 1.40, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (18, '202405566518', '2024011001', '数字电路基础', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (19, '202405566519', '2024011001', '数字电路基础', '34', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (20, '202405566520', '2024011001', '数字电路基础', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (21, '202405566521', '2024011001', '数字电路基础', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (22, '202405566522', '2024011001', '数字电路基础', '34', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (23, '202405566523', '2024011001', '数字电路基础', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (24, '202405566524', '2024011001', '数字电路基础', '34', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (25, '202405566525', '2024011001', '数字电路基础', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (26, '202405566526', '2024011001', '数字电路基础', '75', 2.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (27, '202405566527', '2024011001', '数字电路基础', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (28, '202405566528', '2024011001', '数字电路基础', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (29, '202405566529', '2024011001', '数字电路基础', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (30, '202405566530', '2024011001', '数字电路基础', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (31, '202405566531', '2024011001', '数字电路基础', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (32, '202405566532', '2024011001', '数字电路基础', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (33, '202405566533', '2024011001', '数字电路基础', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (34, '202405566534', '2024011001', '数字电路基础', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (35, '202405566535', '2024011001', '数字电路基础', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (36, '202405566536', '2024011001', '数字电路基础', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (37, '202405566537', '2024011001', '数字电路基础', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (38, '202405566538', '2024011001', '数字电路基础', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (39, '202405566539', '2024011001', '数字电路基础', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (40, '202405566540', '2024011001', '数字电路基础', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (41, '202405566541', '2024011001', '数字电路基础', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (42, '202405566542', '2024011001', '数字电路基础', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (43, '202405566543', '2024011001', '数字电路基础', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (44, '202405566544', '2024011001', '数字电路基础', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (45, '202405566545', '2024011001', '数字电路基础', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (46, '202405566546', '2024011001', '数字电路基础', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (47, '202405566547', '2024011001', '数字电路基础', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (48, '202405566548', '2024011001', '数字电路基础', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (49, '202405566549', '2024011001', '数字电路基础', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (50, '202405566550', '2024011001', '数字电路基础', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (51, '202405565601', '2024011002', '大学物理', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (52, '202405566502', '2024011002', '大学物理', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (53, '202405566503', '2024011002', '大学物理', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (54, '202405566504', '2024011002', '大学物理', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (55, '202405566505', '2024011002', '大学物理', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (56, '202405566506', '2024011002', '大学物理', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (57, '202405566507', '2024011002', '大学物理', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (58, '202405566508', '2024011002', '大学物理', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (59, '202405566509', '2024011002', '大学物理', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (60, '202405566510', '2024011002', '大学物理', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (61, '202405566511', '2024011002', '大学物理', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (62, '202405566512', '2024011002', '大学物理', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (63, '202405566513', '2024011002', '大学物理', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (64, '202405566514', '2024011002', '大学物理', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (65, '202405566515', '2024011002', '大学物理', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (66, '202405566516', '2024011002', '大学物理', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (67, '202405566517', '2024011002', '大学物理', '67', 1.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (68, '202405566518', '2024011002', '大学物理', '67', 1.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (69, '202405566519', '2024011002', '大学物理', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (70, '202405566520', '2024011002', '大学物理', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (71, '202405566521', '2024011002', '大学物理', '34', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (72, '202405566522', '2024011002', '大学物理', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (73, '202405566523', '2024011002', '大学物理', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (74, '202405566524', '2024011002', '大学物理', '68', 1.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (75, '202405566525', '2024011002', '大学物理', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (76, '202405566526', '2024011002', '大学物理', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (77, '202405566527', '2024011002', '大学物理', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (78, '202405566528', '2024011002', '大学物理', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (79, '202405566529', '2024011002', '大学物理', '97', 4.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (80, '202405566530', '2024011002', '大学物理', '67', 1.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (81, '202405566531', '2024011002', '大学物理', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (82, '202405566532', '2024011002', '大学物理', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (83, '202405566533', '2024011002', '大学物理', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (84, '202405566534', '2024011002', '大学物理', '77', 2.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (85, '202405566535', '2024011002', '大学物理', '98', 4.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (86, '202405566536', '2024011002', '大学物理', '32', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (87, '202405566537', '2024011002', '大学物理', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (88, '202405566538', '2024011002', '大学物理', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (89, '202405566539', '2024011002', '大学物理', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (90, '202405566540', '2024011002', '大学物理', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (91, '202405566541', '2024011002', '大学物理', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (92, '202405566542', '2024011002', '大学物理', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (93, '202405566543', '2024011002', '大学物理', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (94, '202405566544', '2024011002', '大学物理', '75', 2.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (95, '202405566545', '2024011002', '大学物理', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (96, '202405566546', '2024011002', '大学物理', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (97, '202405566547', '2024011002', '大学物理', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (98, '202405566548', '2024011002', '大学物理', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (99, '202405566549', '2024011002', '大学物理', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (100, '202405566550', '2024011002', '大学物理', '34', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (101, '202405565601', '2024011003', '线性代数', '23', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (102, '202405566502', '2024011003', '线性代数', '43', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (103, '202405566503', '2024011003', '线性代数', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (104, '202405566504', '2024011003', '线性代数', '100', 5.00, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (105, '202405566505', '2024011003', '线性代数', '100', 5.00, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (106, '202405566506', '2024011003', '线性代数', '75', 2.50, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (107, '202405566507', '2024011003', '线性代数', '100', 5.00, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (108, '202405566508', '2024011003', '线性代数', '76', 2.60, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (109, '202405566509', '2024011003', '线性代数', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (110, '202405566510', '2024011003', '线性代数', '65', 1.50, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (111, '202405566511', '2024011003', '线性代数', '67', 1.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (112, '202405566512', '2024011003', '线性代数', '100', 5.00, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (113, '202405566513', '2024011003', '线性代数', '65', 1.50, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (114, '202405566514', '2024011003', '线性代数', '76', 2.60, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (115, '202405566515', '2024011003', '线性代数', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (116, '202405566516', '2024011003', '线性代数', '78', 2.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (117, '202405566517', '2024011003', '线性代数', '55', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (118, '202405566518', '2024011003', '线性代数', '76', 2.60, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (119, '202405566519', '2024011003', '线性代数', '65', 1.50, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (120, '202405566520', '2024011003', '线性代数', '65', 1.50, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (121, '202405566521', '2024011003', '线性代数', '65', 1.50, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (122, '202405566522', '2024011003', '线性代数', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (123, '202405566523', '2024011003', '线性代数', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (124, '202405566524', '2024011003', '线性代数', '34', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (125, '202405566525', '2024011003', '线性代数', '65', 1.50, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (126, '202405566526', '2024011003', '线性代数', '100', 5.00, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (127, '202405566527', '2024011003', '线性代数', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (128, '202405566528', '2024011003', '线性代数', '65', 1.50, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (129, '202405566529', '2024011003', '线性代数', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (130, '202405566530', '2024011003', '线性代数', '67', 1.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (131, '202405566531', '2024011003', '线性代数', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (132, '202405566532', '2024011003', '线性代数', '78', 2.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (133, '202405566533', '2024011003', '线性代数', '100', 5.00, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (134, '202405566534', '2024011003', '线性代数', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (135, '202405566535', '2024011003', '线性代数', '98', 4.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (136, '202405566536', '2024011003', '线性代数', '65', 1.50, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (137, '202405566537', '2024011003', '线性代数', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (138, '202405566538', '2024011003', '线性代数', '98', 4.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (139, '202405566539', '2024011003', '线性代数', '67', 1.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (140, '202405566540', '2024011003', '线性代数', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (141, '202405566541', '2024011003', '线性代数', '78', 2.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (142, '202405566542', '2024011003', '线性代数', '67', 1.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (143, '202405566543', '2024011003', '线性代数', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (144, '202405566544', '2024011003', '线性代数', '98', 4.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (145, '202405566545', '2024011003', '线性代数', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (146, '202405566546', '2024011003', '线性代数', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (147, '202405566547', '2024011003', '线性代数', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (148, '202405566548', '2024011003', '线性代数', '88', 3.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (149, '202405566549', '2024011003', '线性代数', '66', 1.60, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (150, '202405566550', '2024011003', '线性代数', '77', 2.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (151, '202405565601', '2024011004', '复变函数', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (152, '202405566502', '2024011004', '复变函数', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (153, '202405566503', '2024011004', '复变函数', '76', 2.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (154, '202405566504', '2024011004', '复变函数', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (155, '202405566505', '2024011004', '复变函数', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (156, '202405566506', '2024011004', '复变函数', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (157, '202405566507', '2024011004', '复变函数', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (158, '202405566508', '2024011004', '复变函数', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (159, '202405566509', '2024011004', '复变函数', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (160, '202405566510', '2024011004', '复变函数', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (161, '202405566511', '2024011004', '复变函数', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (162, '202405566512', '2024011004', '复变函数', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (163, '202405566513', '2024011004', '复变函数', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (164, '202405566514', '2024011004', '复变函数', '98', 4.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (165, '202405566515', '2024011004', '复变函数', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (166, '202405566516', '2024011004', '复变函数', '76', 2.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (167, '202405566517', '2024011004', '复变函数', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (168, '202405566518', '2024011004', '复变函数', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (169, '202405566519', '2024011004', '复变函数', '76', 2.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (170, '202405566520', '2024011004', '复变函数', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (171, '202405566521', '2024011004', '复变函数', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (172, '202405566522', '2024011004', '复变函数', '78', 2.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (173, '202405566523', '2024011004', '复变函数', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (174, '202405566524', '2024011004', '复变函数', '76', 2.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (175, '202405566525', '2024011004', '复变函数', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (176, '202405566526', '2024011004', '复变函数', '67', 1.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (177, '202405566527', '2024011004', '复变函数', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (178, '202405566528', '2024011004', '复变函数', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (179, '202405566529', '2024011004', '复变函数', '76', 2.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (180, '202405566530', '2024011004', '复变函数', '77', 2.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (181, '202405566531', '2024011004', '复变函数', '78', 2.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (182, '202405566532', '2024011004', '复变函数', '78', 2.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (183, '202405566533', '2024011004', '复变函数', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (184, '202405566534', '2024011004', '复变函数', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (185, '202405566535', '2024011004', '复变函数', '76', 2.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (186, '202405566536', '2024011004', '复变函数', '76', 2.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (187, '202405566537', '2024011004', '复变函数', '33', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (188, '202405566538', '2024011004', '复变函数', '67', 1.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (189, '202405566539', '2024011004', '复变函数', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (190, '202405566540', '2024011004', '复变函数', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (191, '202405566541', '2024011004', '复变函数', '76', 2.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (192, '202405566542', '2024011004', '复变函数', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (193, '202405566543', '2024011004', '复变函数', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (194, '202405566544', '2024011004', '复变函数', '76', 2.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (195, '202405566545', '2024011004', '复变函数', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (196, '202405566546', '2024011004', '复变函数', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (197, '202405566547', '2024011004', '复变函数', '43', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (198, '202405566548', '2024011004', '复变函数', '73', 2.30, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (199, '202405566549', '2024011004', '复变函数', '32', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (200, '202405566550', '2024011004', '复变函数', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (201, '202405565601', '2024011005', '模拟电子线路', '67', 1.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (202, '202405566502', '2024011005', '模拟电子线路', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (203, '202405566503', '2024011005', '模拟电子线路', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (204, '202405566504', '2024011005', '模拟电子线路', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (205, '202405566505', '2024011005', '模拟电子线路', '64', 1.40, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (206, '202405566506', '2024011005', '模拟电子线路', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (207, '202405566507', '2024011005', '模拟电子线路', '77', 2.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (208, '202405566508', '2024011005', '模拟电子线路', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (209, '202405566509', '2024011005', '模拟电子线路', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (210, '202405566510', '2024011005', '模拟电子线路', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (211, '202405566511', '2024011005', '模拟电子线路', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (212, '202405566512', '2024011005', '模拟电子线路', '74', 2.40, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (213, '202405566513', '2024011005', '模拟电子线路', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (214, '202405566514', '2024011005', '模拟电子线路', '57', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (215, '202405566515', '2024011005', '模拟电子线路', '85', 3.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (216, '202405566516', '2024011005', '模拟电子线路', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (217, '202405566517', '2024011005', '模拟电子线路', '85', 3.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (218, '202405566518', '2024011005', '模拟电子线路', '43', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (219, '202405566519', '2024011005', '模拟电子线路', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (220, '202405566520', '2024011005', '模拟电子线路', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (221, '202405566521', '2024011005', '模拟电子线路', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (222, '202405566522', '2024011005', '模拟电子线路', '34', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (223, '202405566523', '2024011005', '模拟电子线路', '75', 2.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (224, '202405566524', '2024011005', '模拟电子线路', '43', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (225, '202405566525', '2024011005', '模拟电子线路', '74', 2.40, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (226, '202405566526', '2024011005', '模拟电子线路', '77', 2.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (227, '202405566527', '2024011005', '模拟电子线路', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (228, '202405566528', '2024011005', '模拟电子线路', '75', 2.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (229, '202405566529', '2024011005', '模拟电子线路', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (230, '202405566530', '2024011005', '模拟电子线路', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (231, '202405566531', '2024011005', '模拟电子线路', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (232, '202405566532', '2024011005', '模拟电子线路', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (233, '202405566533', '2024011005', '模拟电子线路', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (234, '202405566534', '2024011005', '模拟电子线路', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (235, '202405566535', '2024011005', '模拟电子线路', '97', 4.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (236, '202405566536', '2024011005', '模拟电子线路', '46', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (237, '202405566537', '2024011005', '模拟电子线路', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (238, '202405566538', '2024011005', '模拟电子线路', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (239, '202405566539', '2024011005', '模拟电子线路', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (240, '202405566540', '2024011005', '模拟电子线路', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (241, '202405566541', '2024011005', '模拟电子线路', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (242, '202405566542', '2024011005', '模拟电子线路', '67', 1.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (243, '202405566543', '2024011005', '模拟电子线路', '67', 1.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (244, '202405566544', '2024011005', '模拟电子线路', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (245, '202405566545', '2024011005', '模拟电子线路', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (246, '202405566546', '2024011005', '模拟电子线路', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (247, '202405566547', '2024011005', '模拟电子线路', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (248, '202405566548', '2024011005', '模拟电子线路', '76', 2.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (249, '202405566549', '2024011005', '模拟电子线路', '46', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (250, '202405566550', '2024011005', '模拟电子线路', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (251, '202405565601', '2024011006', '信号与系统', '35', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (252, '202405566502', '2024011006', '信号与系统', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (253, '202405566503', '2024011006', '信号与系统', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (254, '202405566504', '2024011006', '信号与系统', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (255, '202405566505', '2024011006', '信号与系统', '76', 2.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (256, '202405566506', '2024011006', '信号与系统', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (257, '202405566507', '2024011006', '信号与系统', '74', 2.40, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (258, '202405566508', '2024011006', '信号与系统', '86', 3.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (259, '202405566509', '2024011006', '信号与系统', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (260, '202405566510', '2024011006', '信号与系统', '85', 3.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (261, '202405566511', '2024011006', '信号与系统', '86', 3.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (262, '202405566512', '2024011006', '信号与系统', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (263, '202405566513', '2024011006', '信号与系统', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (264, '202405566514', '2024011006', '信号与系统', '43', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (265, '202405566515', '2024011006', '信号与系统', '83', 3.30, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (266, '202405566516', '2024011006', '信号与系统', '75', 2.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (267, '202405566517', '2024011006', '信号与系统', '23', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (268, '202405566518', '2024011006', '信号与系统', '86', 3.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (269, '202405566519', '2024011006', '信号与系统', '37', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (270, '202405566520', '2024011006', '信号与系统', '75', 2.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (271, '202405566521', '2024011006', '信号与系统', '76', 2.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (272, '202405566522', '2024011006', '信号与系统', '34', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (273, '202405566523', '2024011006', '信号与系统', '76', 2.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (274, '202405566524', '2024011006', '信号与系统', '43', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (275, '202405566525', '2024011006', '信号与系统', '86', 3.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (276, '202405566526', '2024011006', '信号与系统', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (277, '202405566527', '2024011006', '信号与系统', '43', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (278, '202405566528', '2024011006', '信号与系统', '86', 3.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (279, '202405566529', '2024011006', '信号与系统', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (280, '202405566530', '2024011006', '信号与系统', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (281, '202405566531', '2024011006', '信号与系统', '95', 4.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (282, '202405566532', '2024011006', '信号与系统', '67', 1.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (283, '202405566533', '2024011006', '信号与系统', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (284, '202405566534', '2024011006', '信号与系统', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (285, '202405566535', '2024011006', '信号与系统', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (286, '202405566536', '2024011006', '信号与系统', '34', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (287, '202405566537', '2024011006', '信号与系统', '77', 2.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (288, '202405566538', '2024011006', '信号与系统', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (289, '202405566539', '2024011006', '信号与系统', '86', 3.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (290, '202405566540', '2024011006', '信号与系统', '76', 2.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (291, '202405566541', '2024011006', '信号与系统', '23', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (292, '202405566542', '2024011006', '信号与系统', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (293, '202405566543', '2024011006', '信号与系统', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (294, '202405566544', '2024011006', '信号与系统', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (295, '202405566545', '2024011006', '信号与系统', '43', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (296, '202405566546', '2024011006', '信号与系统', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (297, '202405566547', '2024011006', '信号与系统', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (298, '202405566548', '2024011006', '信号与系统', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (299, '202405566549', '2024011006', '信号与系统', '43', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (300, '202405566550', '2024011006', '信号与系统', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (301, '202405569501', '2024041001', '高频电子线路', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (302, '202405569502', '2024041001', '高频电子线路', '55', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (303, '202405569503', '2024041001', '高频电子线路', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (304, '202405569504', '2024041001', '高频电子线路', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (305, '202405569505', '2024041001', '高频电子线路', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (306, '202405569506', '2024041001', '高频电子线路', '94', 4.40, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (307, '202405569507', '2024041001', '高频电子线路', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (308, '202405569508', '2024041001', '高频电子线路', '66', 1.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (309, '202405569509', '2024041001', '高频电子线路', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (310, '202405569510', '2024041001', '高频电子线路', '88', 3.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (311, '202405569511', '2024041001', '高频电子线路', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (312, '202405569512', '2024041001', '高频电子线路', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (313, '202405569513', '2024041001', '高频电子线路', '98', 4.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (314, '202405569514', '2024041001', '高频电子线路', '88', 3.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (315, '202405569515', '2024041001', '高频电子线路', '98', 4.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (316, '202405569516', '2024041001', '高频电子线路', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (317, '202405569517', '2024041001', '高频电子线路', '99', 4.90, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (318, '202405569518', '2024041001', '高频电子线路', '88', 3.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (319, '202405569519', '2024041001', '高频电子线路', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (320, '202405569520', '2024041001', '高频电子线路', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (321, '202405569521', '2024041001', '高频电子线路', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (322, '202405569522', '2024041001', '高频电子线路', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (323, '202405569523', '2024041001', '高频电子线路', '55', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (324, '202405569524', '2024041001', '高频电子线路', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (325, '202405569525', '2024041001', '高频电子线路', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (326, '202405569526', '2024041001', '高频电子线路', '12', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (327, '202405569527', '2024041001', '高频电子线路', '55', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (328, '202405569528', '2024041001', '高频电子线路', '66', 1.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (329, '202405569529', '2024041001', '高频电子线路', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (330, '202405569530', '2024041001', '高频电子线路', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (331, '202405569531', '2024041001', '高频电子线路', '56', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (332, '202405569532', '2024041001', '高频电子线路', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (333, '202405569533', '2024041001', '高频电子线路', '100', 5.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (334, '202405569534', '2024041001', '高频电子线路', '55', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (335, '202405569535', '2024041001', '高频电子线路', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (336, '202405569536', '2024041001', '高频电子线路', '89', 3.90, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (337, '202405569537', '2024041001', '高频电子线路', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (338, '202405569538', '2024041001', '高频电子线路', '98', 4.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (339, '202405569539', '2024041001', '高频电子线路', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (340, '202405569540', '2024041001', '高频电子线路', '89', 3.90, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (341, '202405569541', '2024041001', '高频电子线路', '89', 3.90, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (342, '202405569542', '2024041001', '高频电子线路', '89', 3.90, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (343, '202405569543', '2024041001', '高频电子线路', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (344, '202405569544', '2024041001', '高频电子线路', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (345, '202405569545', '2024041001', '高频电子线路', '66', 1.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (346, '202405569546', '2024041001', '高频电子线路', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (347, '202405569547', '2024041001', '高频电子线路', '79', 2.90, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (348, '202405569548', '2024041001', '高频电子线路', '88', 3.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (349, '202405569549', '2024041001', '高频电子线路', '65', 1.50, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (350, '202405569550', '2024041001', '高频电子线路', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (351, '202405569551', '2024041001', '高频电子线路', '66', 1.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (352, '202405569552', '2024041001', '高频电子线路', '87', 3.70, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (353, '202405569553', '2024041001', '高频电子线路', '99', 4.90, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (354, '202405569554', '2024041001', '高频电子线路', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (355, '202405569555', '2024041001', '高频电子线路', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (356, '202405569556', '2024041001', '高频电子线路', '66', 1.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (357, '202405569557', '2024041001', '高频电子线路', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (358, '202405569558', '2024041001', '高频电子线路', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (359, '202405569559', '2024041001', '高频电子线路', '66', 1.60, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (360, '202405569560', '2024041001', '高频电子线路', '78', 2.80, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (361, '202405567511', '2024021001', '物联网工程导论', '88', 3.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (362, '202405567512', '2024021001', '物联网工程导论', '78', 2.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (363, '202405567513', '2024021001', '物联网工程导论', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (364, '202405567514', '2024021001', '物联网工程导论', '66', 1.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (365, '202405567515', '2024021001', '物联网工程导论', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (366, '202405567516', '2024021001', '物联网工程导论', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (367, '202405567517', '2024021001', '物联网工程导论', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (368, '202405567518', '2024021001', '物联网工程导论', '66', 1.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (369, '202405567519', '2024021001', '物联网工程导论', '55', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (370, '202405567520', '2024021001', '物联网工程导论', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (371, '202405567521', '2024021001', '物联网工程导论', '88', 3.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (372, '202405567522', '2024021001', '物联网工程导论', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (373, '202405567523', '2024021001', '物联网工程导论', '98', 4.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (374, '202405567524', '2024021001', '物联网工程导论', '78', 2.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (375, '202405567525', '2024021001', '物联网工程导论', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (376, '202405567526', '2024021001', '物联网工程导论', '66', 1.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (377, '202405567527', '2024021001', '物联网工程导论', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (378, '202405567528', '2024021001', '物联网工程导论', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (379, '202405567529', '2024021001', '物联网工程导论', '88', 3.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (380, '202405567530', '2024021001', '物联网工程导论', '98', 4.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (381, '202405567531', '2024021001', '物联网工程导论', '78', 2.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (382, '202405567532', '2024021001', '物联网工程导论', '98', 4.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (383, '202405567533', '2024021001', '物联网工程导论', '88', 3.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (384, '202405567534', '2024021001', '物联网工程导论', '78', 2.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (385, '202405567535', '2024021001', '物联网工程导论', '98', 4.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (386, '202405567536', '2024021001', '物联网工程导论', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (387, '202405567537', '2024021001', '物联网工程导论', '100', 5.00, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (388, '202405567538', '2024021001', '物联网工程导论', '88', 3.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (389, '202405567539', '2024021001', '物联网工程导论', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (390, '202405567540', '2024021001', '物联网工程导论', '44', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (391, '202405567502', '2024021001', '物联网工程导论', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (392, '202405567503', '2024021001', '物联网工程导论', '89', 3.90, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (393, '202405567504', '2024021001', '物联网工程导论', '78', 2.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (394, '202405567505', '2024021001', '物联网工程导论', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (395, '202405567506', '2024021001', '物联网工程导论', '55', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (396, '202405567507', '2024021001', '物联网工程导论', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (397, '202405567508', '2024021001', '物联网工程导论', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (398, '202405567509', '2024021001', '物联网工程导论', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (399, '202405567510', '2024021001', '物联网工程导论', '66', 1.60, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (400, '202405567501', '2024021001', '物联网工程导论', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (401, '202405567541', '2024021001', '物联网工程导论', '87', 3.70, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (402, '202405567542', '2024021001', '物联网工程导论', '88', 3.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (403, '202405567543', '2024021001', '物联网工程导论', '98', 4.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (404, '202405567544', '2024021001', '物联网工程导论', '78', 2.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (405, '202405567545', '2024021001', '物联网工程导论', '54', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (406, '202405567546', '2024021001', '物联网工程导论', '55', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (407, '202405567547', '2024021001', '物联网工程导论', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (408, '202405567548', '2024021001', '物联网工程导论', '45', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (409, '202405567549', '2024021001', '物联网工程导论', '55', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (410, '202405567550', '2024021001', '物联网工程导论', '65', 1.50, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (411, '202405568501', '2024031001', '计算机网络技术', '88', 3.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (412, '202405568502', '2024031001', '计算机网络技术', '55', 0.00, 0.00, 1, 2024);
INSERT INTO `student_course` VALUES (413, '202405568503', '2024031001', '计算机网络技术', '76', 2.60, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (414, '202405568504', '2024031001', '计算机网络技术', '100', 5.00, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (415, '202405568505', '2024031001', '计算机网络技术', '100', 5.00, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (416, '202405568506', '2024031001', '计算机网络技术', '100', 5.00, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (417, '202405568507', '2024031001', '计算机网络技术', '76', 2.60, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (418, '202405568508', '2024031001', '计算机网络技术', '76', 2.60, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (419, '202405568509', '2024031001', '计算机网络技术', '88', 3.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (420, '202405568510', '2024031001', '计算机网络技术', '67', 1.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (421, '202405568511', '2024031001', '计算机网络技术', '76', 2.60, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (422, '202405568512', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (423, '202405568513', '2024031001', '计算机网络技术', '66', 1.60, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (424, '202405568514', '2024031001', '计算机网络技术', '77', 2.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (425, '202405568515', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (426, '202405568516', '2024031001', '计算机网络技术', '99', 4.90, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (427, '202405568517', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (428, '202405568518', '2024031001', '计算机网络技术', '78', 2.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (429, '202405568519', '2024031001', '计算机网络技术', '88', 3.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (430, '202405568520', '2024031001', '计算机网络技术', '98', 4.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (431, '202405568521', '2024031001', '计算机网络技术', '100', 5.00, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (432, '202405568522', '2024031001', '计算机网络技术', '89', 3.90, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (433, '202405568523', '2024031001', '计算机网络技术', '77', 2.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (434, '202405568524', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (435, '202405568525', '2024031001', '计算机网络技术', '88', 3.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (436, '202405568526', '2024031001', '计算机网络技术', '98', 4.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (437, '202405568527', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (438, '202405568528', '2024031001', '计算机网络技术', '66', 1.60, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (439, '202405568529', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (440, '202405568530', '2024031001', '计算机网络技术', '88', 3.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (441, '202405568531', '2024031001', '计算机网络技术', '88', 3.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (442, '202405568532', '2024031001', '计算机网络技术', '78', 2.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (443, '202405568533', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (444, '202405568534', '2024031001', '计算机网络技术', '77', 2.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (445, '202405568535', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (446, '202405568536', '2024031001', '计算机网络技术', '98', 4.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (447, '202405568537', '2024031001', '计算机网络技术', '78', 2.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (448, '202405568538', '2024031001', '计算机网络技术', '100', 5.00, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (449, '202405568539', '2024031001', '计算机网络技术', '78', 2.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (450, '202405568540', '2024031001', '计算机网络技术', '98', 4.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (451, '202405568541', '2024031001', '计算机网络技术', '78', 2.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (452, '202405568542', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (453, '202405568543', '2024031001', '计算机网络技术', '88', 3.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (454, '202405568544', '2024031001', '计算机网络技术', '78', 2.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (455, '202405568545', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (456, '202405568546', '2024031001', '计算机网络技术', '78', 2.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (457, '202405568547', '2024031001', '计算机网络技术', '99', 4.90, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (458, '202405568548', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (459, '202405568549', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (460, '202405568550', '2024031001', '计算机网络技术', '77', 2.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (461, '202405568551', '2024031001', '计算机网络技术', '89', 3.90, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (462, '202405568552', '2024031001', '计算机网络技术', '78', 2.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (463, '202405568553', '2024031001', '计算机网络技术', '78', 2.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (464, '202405568554', '2024031001', '计算机网络技术', '98', 4.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (465, '202405568555', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (466, '202405568556', '2024031001', '计算机网络技术', '88', 3.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (467, '202405568557', '2024031001', '计算机网络技术', '77', 2.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (468, '202405568558', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (469, '202405568559', '2024031001', '计算机网络技术', '87', 3.70, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (470, '202405568560', '2024031001', '计算机网络技术', '78', 2.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (471, '202405566501', '2024011008', '体育', '88', 3.80, 1.00, 1, 2024);
INSERT INTO `student_course` VALUES (472, '202405566501', '2024011010', '多媒体技术', '88', 3.80, 2.00, 1, 2024);
INSERT INTO `student_course` VALUES (473, '202405566501', '2024011007', '大学英语', '80', 3.00, 4.00, 1, 2024);
INSERT INTO `student_course` VALUES (474, '202405566501', '2024011009', '电子技术', '62', 1.20, 2.00, 1, 2024);

-- ----------------------------
-- Table structure for teacher
-- ----------------------------
DROP TABLE IF EXISTS `teacher`;
CREATE TABLE `teacher`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `password` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `real_name` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `level` tinyint NOT NULL DEFAULT 1,
  `school` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `email` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '0',
  `phone` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL DEFAULT '',
  `sex` tinyint NOT NULL DEFAULT 0,
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 3890291 CHARACTER SET = utf8mb3 COLLATE = utf8mb3_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of teacher
-- ----------------------------
INSERT INTO `teacher` VALUES (3890290, '3890290', '123456', '张三', 1, '湘潭大学', '199999@qq.com', '15877777777', 0, '2023-03-31 15:50:22');

-- ----------------------------
-- Table structure for teacher_course
-- ----------------------------
DROP TABLE IF EXISTS `teacher_course`;
CREATE TABLE `teacher_course`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `teacher_id` varchar(20) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `username` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `profession` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `grade` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `term` tinyint NOT NULL,
  `course_id` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `tc_course`(`course_id` ASC) USING BTREE,
  CONSTRAINT `tc_course` FOREIGN KEY (`course_id`) REFERENCES `course` (`id`) ON DELETE RESTRICT ON UPDATE CASCADE
) ENGINE = InnoDB AUTO_INCREMENT = 29 CHARACTER SET = utf8mb3 COLLATE = utf8mb3_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of teacher_course
-- ----------------------------
INSERT INTO `teacher_course` VALUES (1, '3890290', '3890290', '数字电路基础', '电子信息工程', '2401', 1, '2024011001');
INSERT INTO `teacher_course` VALUES (2, '3890290', '3890290', '物联网工程导论', '物联网', '2401', 1, '2024021001');
INSERT INTO `teacher_course` VALUES (3, '3890290', '3890290', '计算机网络技术', '计算机', '2401', 1, '2024031001');
INSERT INTO `teacher_course` VALUES (4, '3890290', '3890290', '高频电子线路', '通信工程', '2401', 1, '2024041001');
INSERT INTO `teacher_course` VALUES (7, '3890281', '3890281', '大学物理', '电子信息工程', '2401', 1, '2024011002');
INSERT INTO `teacher_course` VALUES (9, '3890281', '3890281', '网络与通信', '计算机', '2401', 1, '2024031002');
INSERT INTO `teacher_course` VALUES (10, '3890281', '3890281', '光纤通讯', '通信工程', '2401', 1, '2024041002');
INSERT INTO `teacher_course` VALUES (11, '3890270', '3890270', '线性代数', '电子信息工程', '2401', 1, '2024011003');
INSERT INTO `teacher_course` VALUES (12, '3890270', '3890270', '现代通信技术', '物联网', '2401', 1, '2024021003');
INSERT INTO `teacher_course` VALUES (13, '3890270', '3890270', '计算机安全', '计算机', '2401', 1, '2024031003');
INSERT INTO `teacher_course` VALUES (14, '3890270', '3890270', '移动通讯', '通信工程', '2401', 1, '2024041003');
INSERT INTO `teacher_course` VALUES (15, '3890261', '3890261', '复变函数', '电子信息工程', '2401', 1, '2024011004');
INSERT INTO `teacher_course` VALUES (16, '3890261', '3890261', '现代传感器技术', '物联网', '2401', 1, '2024021005');
INSERT INTO `teacher_course` VALUES (17, '3890261', '3890261', '算法与数据结构', '计算机', '2401', 1, '2024031004');
INSERT INTO `teacher_course` VALUES (18, '3890261', '3890261', '电路分析', '通信工程', '2401', 1, '2024041004');
INSERT INTO `teacher_course` VALUES (19, '3890251', '3890251', '模拟电子线路', '电子信息工程', '2401', 1, '2024011005');
INSERT INTO `teacher_course` VALUES (20, '3890251', '3890251', '信号与系统概论', '物联网', '2401', 1, '2024021006');
INSERT INTO `teacher_course` VALUES (21, '3890251', '3890251', '多媒体信息处理', '计算机', '2401', 1, '2024031005');
INSERT INTO `teacher_course` VALUES (22, '3890251', '3890251', '程控交换技术', '通信工程', '2401', 1, '2024041005');
INSERT INTO `teacher_course` VALUES (23, '3890240', '3890240', '信号与系统', '电子信息工程', '2401', 1, '2024011006');
INSERT INTO `teacher_course` VALUES (24, '3890240', '3890240', '无线传感器网络', '物联网', '2401', 1, '2024021004');
INSERT INTO `teacher_course` VALUES (25, '3890240', '3890240', '计算机组成原理', '计算机', '2401', 1, '2024031006');
INSERT INTO `teacher_course` VALUES (26, '3890240', '3890240', '光纤通讯', '通信工程', '2401', 1, '2024041006');
INSERT INTO `teacher_course` VALUES (27, '3890221', '3890221', '物联网安全', '物联网', '2401', 1, '2024021002');
INSERT INTO `teacher_course` VALUES (28, '3890230', '3890230', '网络与通信', '计算机', '2401', 1, '2024031002');

-- ----------------------------
-- Table structure for timetable
-- ----------------------------
DROP TABLE IF EXISTS `timetable`;
CREATE TABLE `timetable`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `week_id` int NOT NULL,
  `profession` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `grade` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `year` int NOT NULL,
  `term` tinyint NOT NULL,
  `week_num` int NULL DEFAULT NULL COMMENT '周数',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 41 CHARACTER SET = utf8mb3 COLLATE = utf8mb3_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of timetable
-- ----------------------------
INSERT INTO `timetable` VALUES (1, 1, '电子信息工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (2, 2, '电子信息工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (3, 3, '电子信息工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (4, 4, '电子信息工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (5, 5, '电子信息工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (6, 6, '电子信息工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (7, 7, '电子信息工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (8, 8, '电子信息工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (9, 9, '电子信息工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (10, 10, '电子信息工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (11, 11, '物联网', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (12, 12, '物联网', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (13, 13, '物联网', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (14, 14, '物联网', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (15, 15, '物联网', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (16, 16, '物联网', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (17, 17, '物联网', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (18, 18, '物联网', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (19, 19, '物联网', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (20, 20, '物联网', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (21, 21, '计算机', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (22, 22, '计算机', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (23, 23, '计算机', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (24, 24, '计算机', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (25, 25, '计算机', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (26, 26, '计算机', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (27, 27, '计算机', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (28, 28, '计算机', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (29, 29, '计算机', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (30, 30, '计算机', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (31, 31, '通信工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (32, 32, '通信工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (33, 33, '通信工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (34, 34, '通信工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (35, 35, '通信工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (36, 36, '通信工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (37, 37, '通信工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (38, 38, '通信工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (39, 39, '通信工程', '2401', 2024, 1, 1);
INSERT INTO `timetable` VALUES (40, 40, '通信工程', '2401', 2024, 1, 1);

-- ----------------------------
-- Table structure for upload
-- ----------------------------
DROP TABLE IF EXISTS `upload`;
CREATE TABLE `upload`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `user_id` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `level` int NOT NULL DEFAULT 0,
  `url` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 5 CHARACTER SET = utf8mb3 COLLATE = utf8mb3_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of upload
-- ----------------------------
INSERT INTO `upload` VALUES (1, '1', 0, '/files/3659f8e9-7928-4dbc-a3d9-d8612d4bbadb.jpg');
INSERT INTO `upload` VALUES (2, '3168901102', 2, '/files/98d6ec65-bb2c-4b41-8f7f-ac723085b59b.jpg');
INSERT INTO `upload` VALUES (3, '3890290', 1, '/files/3b7ae9fa-a1de-42dd-812e-9f1ef7c4af60.jpg');
INSERT INTO `upload` VALUES (4, '3168901101', 2, '/files/46f66eca-2631-4745-a1ee-8852b8e78054.jpg');

-- ----------------------------
-- Table structure for week
-- ----------------------------
DROP TABLE IF EXISTS `week`;
CREATE TABLE `week`  (
  `id` int NOT NULL AUTO_INCREMENT,
  `monday` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `tuesday` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `wednesday` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `thursday` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `friday` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `saturday` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  `sunday` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 41 CHARACTER SET = utf8mb3 COLLATE = utf8mb3_general_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of week
-- ----------------------------
INSERT INTO `week` VALUES (1, '大学物理', '一', '模拟电子线路', '一', '一', '一', '一');
INSERT INTO `week` VALUES (2, '大学物理', '一', '模拟电子线路', '一', '一', '一', '一');
INSERT INTO `week` VALUES (3, '一', '线性代数', '一', '复变函数', '信号与系统', '一', '一');
INSERT INTO `week` VALUES (4, '一', '线性代数', '一', '复变函数', '信号与系统', '一', '一');
INSERT INTO `week` VALUES (5, '信号与系统', '数字电路基础', '大学物理', '大学物理', '一', '一', '一');
INSERT INTO `week` VALUES (6, '信号与系统', '数字电路基础', '大学物理', '大学物理', '一', '一', '一');
INSERT INTO `week` VALUES (7, '一', '一', '一', '一', '一', '一', '一');
INSERT INTO `week` VALUES (8, '一', '一', '一', '一', '一', '一', '一');
INSERT INTO `week` VALUES (9, '一', '一', '一', '一', '一', '一', '一');
INSERT INTO `week` VALUES (10, '一', '一', '一', '一', '一', '一', '一');
INSERT INTO `week` VALUES (11, '一', '信号与系统概论', '一', '物联网安全', '现代通信技术', '一', '一');
INSERT INTO `week` VALUES (12, '一', '信号与系统概论', '一', '物联网安全', '现代通信技术', '一', '一');
INSERT INTO `week` VALUES (13, '一', '一', '一', '一', '一', '一', '一');
INSERT INTO `week` VALUES (14, '一', '一', '一', '一', '一', '一', '一');
INSERT INTO `week` VALUES (15, '物联网工程导论', '无线传感器网络', '现代传感器技术', '一', '一', '一', '一');
INSERT INTO `week` VALUES (16, '物联网工程导论', '无线传感器网络', '现代传感器技术', '一', '一', '一', '一');
INSERT INTO `week` VALUES (17, '现代通信技术', '一', '一', '物联网工程导论', '一', '一', '一');
INSERT INTO `week` VALUES (18, '现代通信技术', '一', '一', '物联网工程导论', '一', '一', '一');
INSERT INTO `week` VALUES (19, '一', '一', '一', '一', '一', '一', '一');
INSERT INTO `week` VALUES (20, '一', '一', '一', '一', '一', '一', '一');
INSERT INTO `week` VALUES (21, '一', '算法与数据结构', '一', '一', '一', '一', '一');
INSERT INTO `week` VALUES (22, '一', '算法与数据结构', '一', '一', '一', '一', '一');
INSERT INTO `week` VALUES (23, '网络与通信', '一', '计算机网络技术', '网络与通信', '一', '一', '一');
INSERT INTO `week` VALUES (24, '网络与通信', '一', '计算机网络技术', '网络与通信', '一', '一', '一');
INSERT INTO `week` VALUES (25, '一', '一', '计算机组成原理', '多媒体信息处理', '一', '一', '一');
INSERT INTO `week` VALUES (26, '一', '一', '计算机组成原理', '多媒体信息处理', '一', '一', '一');
INSERT INTO `week` VALUES (27, '一', '多媒体信息处理', '一', '一', '计算机组成原理', '一', '一');
INSERT INTO `week` VALUES (28, '一', '多媒体信息处理', '一', '一', '计算机组成原理', '一', '一');
INSERT INTO `week` VALUES (29, '一', '一', '一', '一', '一', '一', '一');
INSERT INTO `week` VALUES (30, '一', '一', '一', '一', '一', '一', '一');
INSERT INTO `week` VALUES (31, '一', '一', '一', '高频电子线路', '一', '一', '一');
INSERT INTO `week` VALUES (32, '一', '一', '一', '高频电子线路', '一', '一', '一');
INSERT INTO `week` VALUES (33, '一', '一', '一', '光纤通讯', '一', '一', '一');
INSERT INTO `week` VALUES (34, '一', '一', '一', '光纤通讯', '一', '一', '一');
INSERT INTO `week` VALUES (35, '通信原理', '光纤通讯', '一', '电路分析', '移动通讯', '一', '一');
INSERT INTO `week` VALUES (36, '通信原理', '光纤通讯', '一', '电路分析', '移动通讯', '一', '一');
INSERT INTO `week` VALUES (37, '高频电子线路', '一', '电路分析', '一', '一', '一', '一');
INSERT INTO `week` VALUES (38, '高频电子线路', '一', '电路分析', '一', '一', '一', '一');
INSERT INTO `week` VALUES (39, '一', '一', '一', '一', '一', '一', '一');
INSERT INTO `week` VALUES (40, '一', '一', '一', '一', '一', '一', '一');

SET FOREIGN_KEY_CHECKS = 1;
